[
  {
    "numero": 1,
    "pregunta": "If you plan to host a web application in the Azure platform as a service solution of Azure Web Apps, then the platform will have the ability to scale automatically?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 2,
    "pregunta": "You decide to create 2 Virtual machines. Each virtual machine is of the size D2s v3. Would these machines always generate the same monthly cost?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "architecture_services"
  },
  {
    "numero": 3,
    "pregunta": "Your team needs to have a tool that provides a digital online assistant that can provide speech support. Which of the following service can be used for this purpose?",
    "opciones": [
      "Azure Machine Learning.",
      "Azure loT Hub.",
      "Azure Al bot.",
      "Azure Functions."
    ],
    "respuesta": "Azure Al bot.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 4,
    "pregunta": "Your team needs to have a tool that can use past trainings to provide predictions of very high probability. Which of the following service can be used for this purpose?",
    "opciones": [
      "Azure Machine Learning.",
      "Azure loT Hub.",
      "Azure Al bot.",
      "Azure Functions."
    ],
    "respuesta": "Azure Machine Learning.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 5,
    "pregunta": "Your team needs to have a tool that can provide serverless computing capabilities. Which of the following service can be used for this purpose?",
    "opciones": [
      "Azure Machine Learning.",
      "Azure loT Hub.",
      "Azure Al bot.",
      "Azure Functions."
    ],
    "respuesta": "Azure Functions.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 6,
    "pregunta": "Your team needs to have a tool that can be used to process data from millions of sensors. Which of the following service can be used for this purpose?",
    "opciones": [
      "Azure Machine Learning.",
      "Azure loT Hub.",
      "Azure Al bot.",
      "Azure Functions."
    ],
    "respuesta": "Azure loT Hub.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 7,
    "pregunta": "A company needs to deploy a set of resources to Azure. Below are the key requirements for the deployment: The need to be deployed across several departments. The resources that need to be deployed are all of the same type. You need to recommend a solution to automate the deployment of the Azure resources. Which of the following would you use for this requirement?",
    "opciones": [
      "Virtual Machine scale sets.",
      "Management Groups.",
      "Microsoft Entra ID.",
      "Azure Resource Manager Templates."
    ],
    "respuesta": "Azure Resource Manager Templates.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 8,
    "pregunta": "Your company needs to deploy an application to virtual machines hosted in Azure. The solution must ensure an SLA of 99.99%. What is the minimum number of virtual machines and availability zones that you need to recommend for the deployment?",
    "opciones": [
      "One virtual machine and One availability zone.",
      "Two virtual machines and availability zone.",
      "One virtual machine and Two availability zones.",
      "Two virtual machines and Two availability zones."
    ],
    "respuesta": "Two virtual machines and Two availability zones.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 9,
    "pregunta": "Your team needs a tool that can be used to correlate events from multiple resources into a central repository. Which of the following can be used for this purpose?",
    "opciones": [
      "Azure Event Hubs.",
      "Microsoft Defender for Cloud.",
      "Microsoft Entra ID.",
      "Azure Log Analytics."
    ],
    "respuesta": "Azure Log Analytics.",
    "categoria": "administration_governance"
  },
  {
    "numero": 10,
    "pregunta": "A company is planning on hosting an application on an Azure Virtual Machine. It needs to be ensured that the application hosted on the virtual machine is accessible from the Internet over HTTPS. You decide to implement a DDoS protection plan. Would this satisfy the requirement?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "architecture_services"
  },
  {
    "numero": 11,
    "pregunta": "A company is planning on hosting an application on an Azure Virtual Machine. It needs to be ensured that the application hosted on the virtual machine is accessible from the Internet over HTTPS. You decide to implement an Azure Traffic Manager profile. Would this satisfy the requirement?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "architecture_services"
  },
  {
    "numero": 12,
    "pregunta": "Which of the following customers are eligible to use Azure Government to develop a cloud solution? Choose 2 answers from the options given below.",
    "opciones": [
      "United states government Entity.",
      "A United states government contractor.",
      "A European government Entity.",
      "A European government contractor."
    ],
    "respuesta": [
      "United states government Entity.",
      "A United states government contractor."
    ],
    "categoria": "cloud_concepts"
  },
  {
    "numero": 13,
    "pregunta": "A team is currently planning on using Azure for hosting resources. They are going to create users which would have access to the Azure resources. They want to implement Multi-Factor authentication for the users. Is it required to deploy a federated solution to implement Multi-Factor authentication?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 14,
    "pregunta": "A team is currently planning on using Azure for hosting resources. They are going to create users which would have access to the Azure resources. They want to implement Multi-Factor authentication for the users. Are two valid methods for Azure Multi-Factor authentication picture identification and entering a passport number.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 15,
    "pregunta": "Which of the following support plan gives you access to best practice information, health status and notifications, and 24/7 access to billing information at the lowest possible cost.",
    "opciones": [
      "Basic.",
      "Standard.",
      "Premier.",
      "Developer."
    ],
    "respuesta": "Basic.",
    "categoria": "administration_governance"
  },
  {
    "numero": 16,
    "pregunta": "If you plan to host a web application in the Azure platform as a service solution of Azure Web Apps, then you will have complete control over the underlying operating system.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 17,
    "pregunta": "You decide to create a virtual machine which is of the size D2s_v3. If you plan to stop the virtual machine, will you incur any costs for the storage associated with the virtual machine.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "architecture_services"
  },
  {
    "numero": 18,
    "pregunta": "Your company is planning on using Azure for hosting Infrastructure level resources such as Azure Virtual Machines. When planning for the costing aspect for these resources, is there a flexibility offered when it comes to Capital and Operational Expenditure.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "architecture_services"
  },
  {
    "numero": 19,
    "pregunta": "You are looking at using a Software as a Service in Azure. Which of the following would you be responsible for?",
    "opciones": [
      "High availability of the solution.",
      "Configuration of the solution.",
      "Installing the solution.",
      "Scalability of the solution."
    ],
    "respuesta": "Configuration of the solution.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 20,
    "pregunta": "A company is planning on migrating all of their on-premises servers to Azure. Their business continuity department has advised that they need to ensure that servers hosted in Azure are available even if an Azure Data Center were to go down. Which of the following is a concept that would be involved in the design stage for this requirement.",
    "opciones": [
      "Scalability.",
      "Fault Tolerance.",
      "Low Latency.",
      "Elasticity."
    ],
    "respuesta": "Fault Tolerance.",
    "categoria": "administration_governance"
  },
  {
    "numero": 21,
    "pregunta": "Under which of the following circumstances could a company look at decommissioning its data center?",
    "opciones": [
      "If they have their infrastructure hosted in a private cloud.",
      "If they have their infrastructure hosted in the public cloud.",
      "If they have their infrastructure hosted in a hybrid cloud."
    ],
    "respuesta": "If they have their infrastructure hosted in the public cloud.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 22,
    "pregunta": "A company is planning on migrating a web site to Azure. This is a public web site that is used by users on the Internet. Which of the following must the company plan for if they are planning to migrate the web site to Azure?",
    "opciones": [
      "They would need to deploy a VPN.",
      "They would need to pay for the cost to transfer the web site to Azure.",
      "They would need to pay for the monthly costs incurred for hosting the web site.",
      "They would need to pay for the number of connections to the web site."
    ],
    "respuesta": "They would need to pay for the monthly costs incurred for hosting the web site.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 23,
    "pregunta": "An administrator needs to run a script written in PowerShell. This script is going to create a virtual machine in Azure. Would the script run on a computer that runs Linux and has the Azure CLI tools installed?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "architecture_services"
  },
  {
    "numero": 24,
    "pregunta": "An administrator needs to run a script written in PowerShell. This script is going to create a virtual machine in Azure. Would you be able to run the script on a machine that has Chrome OS installed and uses Azure Cloud Shell?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 25,
    "pregunta": "An administrator needs to run a script written in PowerShell. This script is going to create a virtual machine in Azure. Would you be able to run the script on a machine that has macOS and PowerShell core installed?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "architecture_services"
  },
  {
    "numero": 26,
    "pregunta": "An Administrator needs to view the list of planned maintenance events that could potentially affect the availability of the resources hosted in an Azure subscription. Which of the following blade in the Azure portal should the administrator consider for this requirement?",
    "opciones": [
      "Resource Groups.",
      "Microsoft Entra ID.",
      "Azure Advisor.",
      "Help + Support."
    ],
    "respuesta": "Help + Support.",
    "categoria": "administration_governance"
  },
  {
    "numero": 27,
    "pregunta": "Your team needs to have an integrated solution in place that can be used for the deployment of code. Which of the following service can be used for this purpose?",
    "opciones": [
      "Azure Advisor.",
      "Azure Cognitive Services.",
      "Azure Application Insights.",
      "Azure DevOps."
    ],
    "respuesta": "Azure DevOps.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 28,
    "pregunta": "Your team needs a tool that can provide guidance and recommendations that can be used to improve an Azure environment. Which of the following service can be used for this purpose?",
    "opciones": [
      "Azure Advisor.",
      "Azure Cognitive Services.",
      "Azure Application Insights.",
      "Azure DevOps."
    ],
    "respuesta": "Azure Advisor.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 29,
    "pregunta": "Your team needs to use a tool that can be used to build intelligent Artificial Intelligence based applications. Which of the following service can be used for this purpose?",
    "opciones": [
      "Azure Advisor.",
      "Azure Cognitive Services.",
      "Azure Application Insights.",
      "Azure DevOps."
    ],
    "respuesta": "Azure Cognitive Services.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 30,
    "pregunta": "Your team needs to have a tool that can be used to monitor web applications deployed to Azure. Which of the following service can be used for this purpose?",
    "opciones": [
      "Azure Advisor.",
      "Azure Cognitive Services.",
      "Azure Application Insights.",
      "Azure DevOps."
    ],
    "respuesta": "Azure Application Insights.",
    "categoria": "administration_governance"
  },
  {
    "numero": 31,
    "pregunta": "A team currently has several computers in their on-premises environment that runs on Windows 10. They need to share files by enabling mapped drives from the computers. Which of the following would be an ideal storage solution for this requirement?",
    "opciones": [
      "Using the Azure storage - BLOB service.",
      "Using the Azure storage - File service.",
      "Using the Azure storage - Queue service.",
      "Using the Azure storage - Table service."
    ],
    "respuesta": "Using the Azure storage - File service.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 32,
    "pregunta": "A company wants to have a data store hosted in Azure. Below are the key requirements for the data store: The data store must be able to store JSON documents. The data store must be able to handle data writes from multiple regions. Which of the following would be the ideal data store for this requirement?",
    "opciones": [
      "Azure SQL Database.",
      "Azure Cosmos DB.",
      "Azure Redis Cache.",
      "Azure Synapse Analytics."
    ],
    "respuesta": "Azure Cosmos DB.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 33,
    "pregunta": "A team is planning on deploying Azure Virtual Machines to a resource group named demogroup. The group has been created in the US Central region. Do the virtual machines deployed to the resource group also need to be deployed to the US Central region only?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "architecture_services"
  },
  {
    "numero": 34,
    "pregunta": "A team is planning on assigning tags to a resource group. Would the tag be inherited by resources in the resource group?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 35,
    "pregunta": "A set of IAM permissions have been assigned to a resource group. Would the resources in the resource group automatically inherit the IAM permissions assigned to the resource group?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 36,
    "pregunta": "Which of the following service can be used to build, test and deploy a predictive analytics solution that could subsequently be used to deploy an Artificial Intelligence solution to Azure?",
    "opciones": [
      "Azure Functions.",
      "Azure Logic Apps.",
      "Azure Batch.",
      "Azure Machine Learning Studio."
    ],
    "respuesta": "Azure Machine Learning Studio.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 37,
    "pregunta": "Your team is planning on using the Azure Advisor tool. Would the Azure Advisor tool give recommendations on how to configure network settings for Azure virtual machines?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "architecture_services"
  },
  {
    "numero": 38,
    "pregunta": "Your team is planning on using the Azure Advisor tool. Would the Azure Advisor tool give recommendations on how to save costs when it comes to hosting virtual machines in Azure?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "architecture_services"
  },
  {
    "numero": 39,
    "pregunta": "Your team is planning on using the Azure Advisor tool. Would the Azure Advisor tool give recommendations on how to improve the security for Microsoft Entra ID?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 40,
    "pregunta": "A support engineer currently has a computer that runs Ubuntu. Which of the following Azure Management tools could be run from this computer?",
    "opciones": [
      "Azure CLI.",
      "Azure PowerShell.",
      "The Azure Portal."
    ],
    "respuesta": [
      "Azure CLI.",
      "Azure PowerShell.",
      "The Azure Portal."
    ],
    "categoria": "cloud_concepts"
  },
  {
    "numero": 41,
    "pregunta": "Your company has just setup an Azure account and Microsoft Entra ID. They need to ensure that when users connect to Microsoft Entra ID from the Internet from an Anonymous IP address, they are prompted to change their password automatically. Which of the following Azure service can help them achieve this requirement?",
    "opciones": [
      "Microsoft Entra Connect.",
      "Microsoft Entra ID Protection.",
      "Microsoft Entra Privileged Identity Management.",
      "Microsoft Defender for Identity."
    ],
    "respuesta": "Microsoft Entra ID Protection.",
    "categoria": "administration_governance"
  },
  {
    "numero": 42,
    "pregunta": "A company is planning on creating several virtual machines that will be used to host web and database servers. You need to limit the type of connections from the web and database servers. Which of the following can be used to fulfil this requirement?",
    "opciones": [
      "Network Security Groups.",
      "Microsoft Entra ID Protection.",
      "Azure VPN.",
      "Azure Route tables."
    ],
    "respuesta": "Network Security Groups.",
    "categoria": "architecture_services"
  },
  {
    "numero": 43,
    "pregunta": "Which of the following can be used to allow an organization to manage the compliance of resources across multiple subscriptions?",
    "opciones": [
      "Resource Groups.",
      "Management Groups.",
      "Azure Policies.",
      "Azure Resource Manager templates."
    ],
    "respuesta": "Azure Policies.",
    "categoria": "administration_governance"
  },
  {
    "numero": 44,
    "pregunta": "Your company is planning on setting an Azure environment by setting up a subscription and Microsoft Entra ID. They need to purchase a low-cost option support plan. The support plan needs to ensure 24*7 access to support engineers by phone or email. You suggest opting for the Basic Support plan. Does this support the requirement?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 45,
    "pregunta": "Your company is planning on setting an Azure environment by setting up a subscription and Microsoft Entra ID. They need to purchase a low-cost option support plan. The support plan needs to ensure 24*7 access to support engineers by phone or email. You suggest opting for the Standard Support plan. Does this support the requirement?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 46,
    "pregunta": "Does Microsoft release most of the Azure services in private preview before being introduced in public preview?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 47,
    "pregunta": "Is it true that Azure services released in public preview can only be managed via the Azure command line interface?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 48,
    "pregunta": "Is it true that an Azure service that is released in private preview is made available to all Azure customers?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 49,
    "pregunta": "Is it true that an Azure service that is released in public preview is made available to all Azure customers?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 50,
    "pregunta": "Is it true that an Azure service that is released as generally available is made available to all Azure customers?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 51,
    "pregunta": "Can a single Microsoft Account be used to manage multiple Azure subscriptions?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 52,
    "pregunta": "Is it possible to merge subscriptions into a single subscription?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 53,
    "pregunta": "A company has just started using Azure. They have setup a subscription and started deploying resources to Azure. Would they be guaranteed a service level agreement of at least 99.9% for paid Azure services?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 54,
    "pregunta": "A company has just started using Azure. They have setup a subscription and started deploying resources to Azure. Could the company increase the SLA for their resources by deploying resources across multiple regions?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 55,
    "pregunta": "A company has just started using Azure. They have setup a subscription and started deploying resources to Azure. Could the company increase the SLA for their resources by purchasing multiple subscriptions?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 56,
    "pregunta": "A set of virtual machines have been created in a subscription. You have now paid for a new subscription. Is it possible to move the virtual machines to the new subscription?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "architecture_services"
  },
  {
    "numero": 57,
    "pregunta": "A company has defined the following resources in Azure: 10 Public IP addresses. 20 users in Microsoft Entra ID. 5 user groups in Microsoft Entra ID. They now want to reduce the costs associated with the Azure account. Would the removal of the users from the account help reduce the cost?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 58,
    "pregunta": "A company has defined the following resources in Azure: 10 Public IP addresses. 20 users in Microsoft Entra ID. 5 user groups in Microsoft Entra ID. They now want to reduce the costs associated with the Azure account. Would the removal of the user groups from the account help reduce the cost?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 59,
    "pregunta": "A company has defined the following resources in Azure: 10 Public IP addresses. 20 users in Microsoft Entra ID. 5 user groups in Microsoft Entra ID. They now want to reduce the costs associated with the Azure account. Would the removal of the public IP addresses from the account help reduce the cost?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 60,
    "pregunta": "A team member currently has a laptop that is based on the Android OS. The team member wants to create a virtual machine in Azure. The team member decides to use the Azure portal to create the virtual machine. Would this suit the purpose?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "architecture_services"
  },
  {
    "numero": 61,
    "pregunta": "A team member currently has a laptop that is based on the Android OS. The team member wants to create a virtual machine in Azure. The team member decides to use the PowerApps portal to create the virtual machine. Would this suit the purpose?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "architecture_services"
  },
  {
    "numero": 62,
    "pregunta": "Which of the following URL is used to manage the creation of Azure resources?",
    "opciones": [
      "`https://admin.azure.com`.",
      "`https://admin.azurewebsites.com`.",
      "`https://portal.microsoft.com`.",
      "`https://portal.azurewebsites.com`.",
      "`https://portal.azure.com`."
    ],
    "respuesta": "`https://portal.azure.com`.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 63,
    "pregunta": "You need to create a virtual machine in Azure. Which of the following storage account service is used to store the data disks for the virtual machine?",
    "opciones": [
      "Blobs.",
      "Files.",
      "Tables.",
      "Queues."
    ],
    "respuesta": "Blobs.",
    "categoria": "architecture_services"
  },
  {
    "numero": 64,
    "pregunta": "Your company needs to have a data store in Azure. Below are the key requirements for the data store: The data store should be capable of storing 10TB of data. The data would be accessed infrequently. The data would need to be visualised using PowerBI. Which of the following services could you use for this requirement? Choose 2 answers from the options given below.",
    "opciones": [
      "Azure SQL database.",
      "Azure Synapse Analytics.",
      "Azure Data Lake.",
      "Azure Cosmos DB."
    ],
    "respuesta": [
      "Azure Synapse Analytics.",
      "Azure Data Lake."
    ],
    "categoria": "cloud_concepts"
  },
  {
    "numero": 65,
    "pregunta": "You need to deploy several virtual machines to Azure. You need to ensure that you can assign permissions to the virtual machines simultaneously. Which of the following can be implemented to fulfil this requirement?",
    "opciones": [
      "Deploy all the virtual machines to the same region.",
      "Deploy all the virtual machines to the same resource group.",
      "Deploy all the virtual machines to the same availability zone.",
      "Deploy all the virtual machines to the same scale."
    ],
    "respuesta": "Deploy all the virtual machines to the same resource group.",
    "categoria": "architecture_services"
  },
  {
    "numero": 66,
    "pregunta": "Which of the following is a benefit of moving on-premises servers to the Azure cloud environment?",
    "opciones": [
      "The Azure platform is a public cloud platform wherein all the resources can be accessed by the public.",
      "The Azure platform is a private cloud platform wherein all the resources can be accessed only by a private handful of people.",
      "The Azure platform is a shared platform wherein multiple companies can use a portion of the resources on the platform.",
      "The Azure platform is an ecommerce platform wherein users can buy and sell resources as required."
    ],
    "respuesta": "The Azure platform is a shared platform wherein multiple companies can use a portion of the resources on the platform.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 67,
    "pregunta": "What are two key characteristics of the public cloud?",
    "opciones": [
      "Dedicated hardware resources.",
      "Shared infrastructure.",
      "Pay-as-you-go model.",
      "On-premises deployment.",
      "Limited geographic availability."
    ],
    "respuesta": [
      "Shared infrastructure.",
      "Pay-as-you-go model."
    ],
    "categoria": "cloud_concepts"
  },
  {
    "numero": 68,
    "pregunta": "Your company plans to migrate all its data and resources to Azure. The company migration plan states that only Platform as a Service (PaaS) solutions must be used in Azure. You need to deploy an Azure environment that meets the company migration plan. Solution: You create an Azure App Service and Azure SQL databases. Does this meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 69,
    "pregunta": "You plan to migrate a web application to Azure. The web application is accessed by external users. You need to recommend a cloud deployment solution to minimize the amount of administrative effort used to manage the web application. What should you include in the recommendation?",
    "opciones": [
      "Software as a Service (SaaS).",
      "Platform as a Service (PaaS).",
      "Infrastructure as a Service (laaS).",
      "Database as a Service (DaaS)."
    ],
    "respuesta": "Platform as a Service (PaaS).",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 70,
    "pregunta": "You have an on-premises network that contains 100 servers. You need to recommend a solution that provides additional resources to your users. The solution must minimize capital and operational expenditure costs. What should you include in the recommendation?",
    "opciones": [
      "A complete migration to the public cloud.",
      "An additional data center.",
      "A private cloud.",
      "A hybrid cloud."
    ],
    "respuesta": "A hybrid cloud.",
    "categoria": "administration_governance"
  },
  {
    "numero": 71,
    "pregunta": "You plan to migrate several servers from an on-premises network to Azure. What is an advantage of using a public cloud service for the servers over an on-premises network?",
    "opciones": [
      "The public cloud is owned by the public, NOT a private corporation.",
      "The public cloud is a crowd-sourcing solution that provides corporations with the ability to enhance the cloud.",
      "All public cloud resources can be freely accessed by every member of the public.",
      "The public cloud is a shared entity whereby multiple corporations each use a portion of the resources in the cloud."
    ],
    "respuesta": "The public cloud is a shared entity whereby multiple corporations each use a portion of the resources in the cloud.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 72,
    "pregunta": "You have 1,000 virtual machines hosted on the Hyper-V hosts in a data center. You plan to migrate all the virtual machines to an Azure pay-as-you-go subscription. You need to identify which expenditure model to use for the planned Azure solution. Which expenditure model should you identify?",
    "opciones": [
      "Operational.",
      "Elastic.",
      "Capital.",
      "Scalable."
    ],
    "respuesta": "Operational.",
    "categoria": "architecture_services"
  },
  {
    "numero": 73,
    "pregunta": "You plan to provision Infrastructure as a Service (laaS) resources in Azure. Which resource is an example of laaS?",
    "opciones": [
      "An Azure web app.",
      "An Azure virtual machine.",
      "An Azure logic app.",
      "An Azure SQL database."
    ],
    "respuesta": "An Azure virtual machine.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 74,
    "pregunta": "A team of developers at your company plans to deploy, and then remove, 50 virtual machines each week. All the virtual machines are configured by using Azure Resource Manager templates. You need to recommend which Azure service will minimize the administrative effort required to deploy and remove the virtual machines. What should you recommend?",
    "opciones": [
      "Azure Reserved Virtual Machine (VM) Instances.",
      "Azure DevTest Labs.",
      "Azure virtual machine scale sets.",
      "Microsoft Managed Desktop."
    ],
    "respuesta": "Azure DevTest Labs.",
    "categoria": "architecture_services"
  },
  {
    "numero": 75,
    "pregunta": "Your company plans to migrate all its data and resources to Azure. The company migration plan states that only Platform as a Service (PaaS) solutions must be used in Azure. You need to deploy an Azure environment that meets the company migration plan. Solution: You create an Azure virtual machines, Azure SQL databases, and Azure Storage accounts. Does this meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 76,
    "pregunta": "Your company plans to deploy several custom applications to Azure. The applications will provide invoicing services to the customers of the company. Each application will have several prerequisite applications and services installed. You need to recommend a cloud deployment solution for all the applications. What should you recommend?",
    "opciones": [
      "Software as a Service (SaaS).",
      "Platform as a Service (PaaS).",
      "Infrastructure as a Service (laas)."
    ],
    "respuesta": "Infrastructure as a Service (laas).",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 77,
    "pregunta": "[An Azure region] contains one or more data centers that are connected by using a low-latency network.",
    "opciones": [
      "No change is needed.",
      "Is found in each country where Microsoft has a subsidiary office.",
      "Can be found in every country in Europe and the Americas only.",
      "Contains one or more data centers that are connected by using a high-latency network."
    ],
    "respuesta": "No change is needed.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 78,
    "pregunta": "A support engineer plans to perform several Azure management tasks by using the Azure CLI. You install the CLI on a computer. You need to tell the support engineer which tools to use to run the CLI. Which two tools should you instruct the support engineer to use?",
    "opciones": [
      "Command Prompt.",
      "Azure Resource Explorer.",
      "Windowe PowerShell.",
      "Windows Defender Firewall.",
      "Network and Sharing Center."
    ],
    "respuesta": [
      "Command Prompt.",
      "Windowe PowerShell."
    ],
    "categoria": "cloud_concepts"
  },
  {
    "numero": 79,
    "pregunta": "You plan to store 20 TB of data in Azure. The data will be accessed infrequently and visualized by using Microsoft Power BI. You need to recommend a storage solution for the data Which two solutions should you recommend?",
    "opciones": [
      "Azure Data Lake.",
      "Azure Cosmos DB.",
      "Azure Synapse Analytics.",
      "Azure SQL Database.",
      "Azure Database for PostgreSQL."
    ],
    "respuesta": [
      "Azure Data Lake.",
      "Azure Synapse Analytics."
    ],
    "categoria": "cloud_concepts"
  },
  {
    "numero": 80,
    "pregunta": "You need to identify the type of failure for which an Azure Availability Zone can be used to protect access to Azure services. What should you identify?",
    "opciones": [
      "A physical server failure.",
      "An Azure region failure.",
      "A storage failure.",
      "An Azure data center failure."
    ],
    "respuesta": "An Azure data center failure.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 81,
    "pregunta": "You have a virtual machine named VM1 that runs Windows Server 2016. VM1 is in the East US Azure region. Which Azure service should you use from the Azure portal to view service failure notifications that can affect the availability of VM1?",
    "opciones": [
      "Azure Service Fabric.",
      "Azure Monitor.",
      "Azure virtual machines.",
      "Azure Advisor."
    ],
    "respuesta": "Azure virtual machines.",
    "categoria": "architecture_services"
  },
  {
    "numero": 82,
    "pregunta": "An Azure administrator plans to run a PowerShell script that creates Azure resources. You need to recommend which computer configuration to use to run the script. Solution: Run the script from a computer that runs Linux and has the Azure CLI tools installed. Does this meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 83,
    "pregunta": "An Azure administrator plans to run a PowerShell script that creates Azure resources. You need to recommend which computer configuration to use to run the script. Solution: Run the script from a computer that runs Chrome OS and uses Azure Cloud Shell Does this meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 84,
    "pregunta": "You have an Azure environment that contains 10 virtual networks and 100 virtual machines You need to limit the amount of inbound traffic to all the Azure virtual network. What should you create?",
    "opciones": [
      "One application security group (ASG).",
      "10 virtual network gateways.",
      "10 Azure ExpressRoute circuits.",
      "One Azure firewall."
    ],
    "respuesta": "One Azure firewall.",
    "categoria": "architecture_services"
  },
  {
    "numero": 85,
    "pregunta": "You have an Azure environment that contains multiple Azure virtual machines. You plan to implement a solution that enables the client computers on your on-premises network to communicate to the Azure virtual machines. You need to recommend which Azure resources must be created for the planned solution. Which two Azure resources should you include in the recommendation?",
    "opciones": [
      "A virtual network gateway.",
      "A load balancer.",
      "An application gateway.",
      "A virtual network.",
      "A gateway subnet."
    ],
    "respuesta": [
      "A virtual network gateway.",
      "A gateway subnet."
    ],
    "categoria": "architecture_services"
  },
  {
    "numero": 86,
    "pregunta": "You have an Azure environment. You need to create a new Azure virtual machine from a tablet that runs the Android operating system. Solution: You use Bash in Azure Cloud Shell. Does this meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 87,
    "pregunta": "Your company plans to move several servers to Azure. The company compliance policy states that a server named FinServer must be on a separate network segment. You are evaluating which Azure services can be used to meet the compliance policy requirements. Which Azure solution should you recommend?",
    "opciones": [
      "A resource group for FinServer and another resource group for all the other servers.",
      "A virtual network for FinServer and another virtual network for all the other servers.",
      "A VPN for FinServer and a virtual network gateway for another server.",
      "One resource group for all the servers and a resource lock for FinServer."
    ],
    "respuesta": "A virtual network for FinServer and another virtual network for all the other servers.",
    "categoria": "administration_governance"
  },
  {
    "numero": 88,
    "pregunta": "You plan to map a network drive from several computers that run Windows 10 to Azure Storage. You need to create a storage solution in Azure for the planned mapped drive. What should you create?",
    "opciones": [
      "An Azure SQL database.",
      "A virtual machine data disk.",
      "A Files service in a storage account.",
      "A Blobs service in a storage account."
    ],
    "respuesta": "A Files service in a storage account.",
    "categoria": "architecture_services"
  },
  {
    "numero": 89,
    "pregunta": "Your company plans to migrate all its network resources to Azure. You need to start the planning process by exploring Azure. What should you create first?",
    "opciones": [
      "A subscription.",
      "A resource group.",
      "A virtual network.",
      "A management group."
    ],
    "respuesta": "A subscription.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 90,
    "pregunta": "You have an on-premises application that sends email notifications automatically based on a rule, You plan to migrate the application to Azure. You need to recommend a serverless computing solution for the application. What should you include in the recommendation?",
    "opciones": [
      "A web app.",
      "A server image in Azure Marketplace.",
      "A logic app.",
      "An API app."
    ],
    "respuesta": "A logic app.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 91,
    "pregunta": "You plan to deploy a website to Azure. The website will be accessed by users worldwide and will host large video files. You need to recommend which Azure feature must be used to provide the best video playback experience. What should you recommend?",
    "opciones": [
      "An application gateway.",
      "An Azure ExpressRoute circuit.",
      "A content delivery network (CDN).",
      "An Azure Traffic Manager profile."
    ],
    "respuesta": "A content delivery network (CDN).",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 92,
    "pregunta": "Your company plans to deploy several million sensors that will upload data to Azure. You need to identify which Azure resources must be created to support the planned solution. Which two Azure resources should you identify?",
    "opciones": [
      "Azure Data Lake.",
      "Azure Queue storage.",
      "Azure File Storage.",
      "Azure IoT Hub.",
      "Azure Notification Hubs."
    ],
    "respuesta": [
      "Azure Data Lake.",
      "Azure IoT Hub."
    ],
    "categoria": "cloud_concepts"
  },
  {
    "numero": 93,
    "pregunta": "You have an Azure web app. You need to manage the settings of the web app from an iPhone. What are two Azure management tools that you can use?",
    "opciones": [
      "Azure CLI.",
      "The Azure portal.",
      "Azure Cloud Shell.",
      "Windows PowerShell.",
      "Azure Storage Explorer."
    ],
    "respuesta": [
      "The Azure portal.",
      "Azure Cloud Shell."
    ],
    "categoria": "cloud_concepts"
  },
  {
    "numero": 94,
    "pregunta": "Company plans to deploy an Artificial Intelligence (AI) solution in Azure. What should the company use to build, test, and deploy predictive analytics solutions?",
    "opciones": [
      "Azure Logic Apps.",
      "Azure Machine Learning Studio.",
      "Azure Batch.",
      "Azure Cosmos DB."
    ],
    "respuesta": "Azure Machine Learning Studio.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 95,
    "pregunta": "You have an Azure subscription named Subscription1. You sign in to the Azure portal and create a resource group named RG1. From Azure documentation, you have the following command that creates a virtual machine named VM1. `az vm create --resource-group RG1 --name VM1 --image UbuntuLTS --generate-ssh-keys`. You need to create VM1 in Subscription1 by using the command. Solution: From the Azure portal, launch Azure Cloud Shell and select PowerShell. Run the command in Cloud Shell. Does this meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 96,
    "pregunta": "An Azure administrator plans to run a PowerShell script that creates Azure resources. You need to recommend which computer configuration to use to run the script. Solution: Run the script from a computer that runs Windows 10 and has the Azure PowerShell module installed. Does this meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 97,
    "pregunta": "Which service provides serverless computing in Azure?",
    "opciones": [
      "Azure Virtual Machines.",
      "Azure Functions.",
      "Azure storage account.",
      "Azure Container Instances."
    ],
    "respuesta": "Azure Functions.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 98,
    "pregunta": "You have an Azure subscription named Subscription1. You sign in to the Azure portal and create a resource group named RG1. From Azure documentation, you have the following command that creates a virtual machine named VM1. `az vm create --resource-group RG1 --name VM1 --image UbuntuLTS --generate-ssh-keys`. You need to create VM1 in Subscription1 by using the command. Solution: From the Azure portal, launch Azure Cloud Shell and select Bash. Run the command in Cloud Shell. Does this meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 99,
    "pregunta": "Your company has several business units. Each business unit requires 20 different Azure resources for daily operation. All the business units require the same type of Azure resources. You need to recommend a solution to automate the creation of the Azure resources. What should you include in the recommendations?",
    "opciones": [
      "Azure Resource Manager templates.",
      "Virtual machine scale sets.",
      "The Azure API Management service.",
      "Management groups."
    ],
    "respuesta": "Azure Resource Manager templates.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 100,
    "pregunta": "Which Azure service should you use to collect events from multiple resources into a centralized repository?",
    "opciones": [
      "Azure Event Hubs.",
      "Azure Analysis Services.",
      "Azure Monitor.",
      "Azure Stream Analytics."
    ],
    "respuesta": "Azure Event Hubs.",
    "categoria": "administration_governance"
  },
  {
    "numero": 101,
    "pregunta": "You have an Azure environment. You need to create a new Azure virtual machine from a tablet that runs the Android operating system. Solution: You use the PowerApps portal. Does this meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "architecture_services"
  },
  {
    "numero": 102,
    "pregunta": "You have an Azure environment. You need to create a new Azure virtual machine from a tablet that runs the Android operating system. Solution: You use the Azure portal. Does this meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "architecture_services"
  },
  {
    "numero": 103,
    "pregunta": "Which Azure service provides a set of version control tools to manage code?",
    "opciones": [
      "Azure Repos.",
      "Azure DevTest Labs.",
      "Azure Storage.",
      "Azure Cosmos DB."
    ],
    "respuesta": "Azure Repos.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 104,
    "pregunta": "Your company plans to automate the deployment of servers to Azure. Your manager is concerned that you may expose administrative credentials during the deployment. You need to recommend an Azure solution that encrypts the administrative credentials during the deployment. What should you include in the recommendation?",
    "opciones": [
      "Azure Key Vault.",
      "Microsoft Purview Information Protection.",
      "Microsoft Defender for Cloud.",
      "Azure Multi-Factor Authentication (MFA)."
    ],
    "respuesta": "Azure Key Vault.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 105,
    "pregunta": "You plan to deploy several Azure virtual machines. You need to control the ports that devices on the Internet can use to access the virtual machines. What should you use?",
    "opciones": [
      "Network Security Group (NSG).",
      "Microsoft Entra ID role.",
      "Microsoft Entra ID group.",
      "Azure key vault."
    ],
    "respuesta": "Network Security Group (NSG).",
    "categoria": "architecture_services"
  },
  {
    "numero": 106,
    "pregunta": "Azure Germany can be used by legal residents of Germany only.",
    "opciones": [
      "No change is needed.",
      "Only enterprises that are registered in Germany.",
      "Only enterprises that purchase their azure licenses from a partner based in Germany.",
      "This service has been discontinued. Azure Germany was retired in 2021."
    ],
    "respuesta": "This service has been discontinued. Azure Germany was retired in 2021.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 107,
    "pregunta": "Your Azure environment contains multiple Azure virtual machines. You need to ensure that a virtual machine named VM1 is accessible from the Internet over HTTP. Solution. You modify a Network Security Group (NSG). Does this meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "architecture_services"
  },
  {
    "numero": 108,
    "pregunta": "Your Azure environment contains multiple Azure virtual machines. You need to ensure that a virtual machine named VM1 is accessible from the Internet over HTTP. Solution: You modify an Azure firewall. Does this meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "architecture_services"
  },
  {
    "numero": 109,
    "pregunta": "Your Azure environment contains multiple Azure virtual machines. You need to ensure that a virtual machine named VM1 is accessible from the Internet over HTTP. Solution: You modify an Azure Traffic Manager profile. Does this meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "architecture_services"
  },
  {
    "numero": 110,
    "pregunta": "Which two types of customers are eligible to use Azure Government to develop a cloud solution?",
    "opciones": [
      "A Canadian government contractor.",
      "A European government contractor.",
      "A United States government entity.",
      "A United States government contractor.",
      "A European government entity."
    ],
    "respuesta": [
      "A United States government entity.",
      "A United States government contractor."
    ],
    "categoria": "cloud_concepts"
  },
  {
    "numero": 111,
    "pregunta": "You need to ensure that when Microsoft Entra ID users connect to Microsoft Entra ID from the Internet by using an anonymous IP address, the users are prompted automatically to change their password. Which Azure service should you use?",
    "opciones": [
      "Microsoft Entra Connect Health.",
      "Microsoft Entra Privileged Identity Management.",
      "Microsoft Defender for Identity.",
      "Microsoft Entra ID Protection."
    ],
    "respuesta": "Microsoft Entra ID Protection.",
    "categoria": "administration_governance"
  },
  {
    "numero": 112,
    "pregunta": "Your company plans to deploy several web servers and several database servers to Azure. You need to recommend an Azure solution to limit the types of connections from the web servers to the database servers. What should you include in the recommendation?",
    "opciones": [
      "Network Security Groups (NSGs).",
      "Azure Service Bus.",
      "A local network gateway.",
      "A route filter."
    ],
    "respuesta": "Network Security Groups (NSGs).",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 113,
    "pregunta": "To what should an application connect to retrieve security tokens?",
    "opciones": [
      "An Azure Storage account.",
      "Microsoft Entra ID.",
      "A certificate store.",
      "An Azure key vault."
    ],
    "respuesta": "Microsoft Entra ID.",
    "categoria": "administration_governance"
  },
  {
    "numero": 114,
    "pregunta": "Which service provides network traffic filtering across multiple Azure subscriptions and virtual networks?",
    "opciones": [
      "Azure Firewall.",
      "An application security group.",
      "Azure DDoS protection.",
      "A Network Security Group (NSG)."
    ],
    "respuesta": "Azure Firewall.",
    "categoria": "architecture_services"
  },
  {
    "numero": 115,
    "pregunta": "Which Azure service should you use to store certificates?",
    "opciones": [
      "Microsoft Defender for Cloud.",
      "An Azure Storage account.",
      "Azure Key Vault.",
      "Microsoft Purview Information Protection."
    ],
    "respuesta": "Azure Key Vault.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 116,
    "pregunta": "You have a resource group named RG1. You plan to create virtual networks and app services in RG1. You need to prevent the creation of virtual machines only in RG1. What should you use?",
    "opciones": [
      "A lock.",
      "An Azure role.",
      "A tag.",
      "An Azure policy."
    ],
    "respuesta": "An Azure policy.",
    "categoria": "architecture_services"
  },
  {
    "numero": 117,
    "pregunta": "What can Microsoft Purview Information Protection encrypt?",
    "opciones": [
      "Network traffic.",
      "Documents and email messages.",
      "An Azure Storage account.",
      "An Azure SQL database."
    ],
    "respuesta": "Documents and email messages.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 118,
    "pregunta": "From [Azure Monitor], you can view which user turned off a specific virtual machine during the last 14 days.",
    "opciones": [
      "No change is needed.",
      "Azure Event Hubs.",
      "Azure Activity Log.",
      "Azure Service Health."
    ],
    "respuesta": "Azure Activity Log.",
    "categoria": "architecture_services"
  },
  {
    "numero": 119,
    "pregunta": "Your company has an Azure subscription that contains resources in several regions. A company policy states that administrators must only be allowed to create additional Azure resources in a region in the country where their office is located. You need to create the Azure resource that must be used to meet the policy requirement. What should you create?",
    "opciones": [
      "A read-only lock.",
      "An Azure policy.",
      "A management group.",
      "A reservation."
    ],
    "respuesta": "An Azure policy.",
    "categoria": "administration_governance"
  },
  {
    "numero": 120,
    "pregunta": "From [Azure Cloud Shell], you can track your company regulatory standards and regulations, such as ISO 27001.",
    "opciones": [
      "No change is needed.",
      "The Microsoft Cloud Partner Portal.",
      "Compliance Manager.",
      "The Trust Center."
    ],
    "respuesta": "Compliance Manager.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 121,
    "pregunta": "You need to configure an Azure solution that meets the following requirements: Secures websites from attacks. Generates reports that contain details of attempted attacks. What should you include in the solution?",
    "opciones": [
      "Azure Firewall.",
      "A Network Security Group (NSG).",
      "Microsoft Purview Information Protection.",
      "DDoS protection."
    ],
    "respuesta": "DDoS protection.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 122,
    "pregunta": "You attempt to create several managed Microsoft SQL Server instances in an Azure environment and receive a message that you must increase your Azure subscription limits. What should you do to increase the limits?",
    "opciones": [
      "Create a service health alert.",
      "Upgrade your support plan.",
      "Modify an Azure policy.",
      "Create a new support request."
    ],
    "respuesta": "Create a new support request.",
    "categoria": "administration_governance"
  },
  {
    "numero": 123,
    "pregunta": "Your company has 10 offices. You plan to generate several billing reports from the Azure portal. Each report will contain the Azure resource utilization of each office. Which Azure Resource Manager feature should you use before you generate the reports?",
    "opciones": [
      "Tags.",
      "Templates.",
      "Locks.",
      "Policies."
    ],
    "respuesta": "Tags.",
    "categoria": "administration_governance"
  },
  {
    "numero": 124,
    "pregunta": "Your company plans to migrate to Azure. The company has several departments. All the Azure resources used by each department will be managed by a department administrator. What are two possible techniques to segment Azure for the departments?",
    "opciones": [
      "Multiple subscriptions.",
      "Multiple Microsoft Entra ID directories.",
      "Multiple regions.",
      "Multiple resource groups."
    ],
    "respuesta": [
      "Multiple subscriptions.",
      "Multiple resource groups."
    ],
    "categoria": "cloud_concepts"
  },
  {
    "numero": 125,
    "pregunta": "In which Azure support plans can you open a new support request?",
    "opciones": [
      "Professional Direct only.",
      "Professional Direct, and Standard only.",
      "Professional Direct, Standard, and Developer only.",
      "Professional Direct, Standard, Developer, and Basic."
    ],
    "respuesta": "Professional Direct, Standard, Developer, and Basic.",
    "categoria": "administration_governance"
  },
  {
    "numero": 126,
    "pregunta": "What is guaranteed in an Azure Service Level Agreement (SLA) for virtual machines?",
    "opciones": [
      "Uptime.",
      "Feature availability.",
      "Bandwidth.",
      "Performance."
    ],
    "respuesta": "Uptime.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 127,
    "pregunta": "Your company plans to purchase an Azure subscription. The company support policy states that the Azure environment must provide an option to access support engineers by phone or email. You need to recommend which support plan meets the support policy requirement. Solution: Recommend a Basic support plan. Does this meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 128,
    "pregunta": "Your company plans to request an architectural review of an Azure environment from Microsoft. The company currently has a Basic support plan. You need to recommend a new support plan for the company. The solution must minimize costs. Which support plan should you recommend?",
    "opciones": [
      "Developer.",
      "Professional Direct.",
      "Standard."
    ],
    "respuesta": "Developer.",
    "categoria": "administration_governance"
  },
  {
    "numero": 129,
    "pregunta": "What is required to use Azure Cost Management?",
    "opciones": [
      "A Dev/Test subscription.",
      "Software Assurance.",
      "An Enterprise Agreement (EA).",
      "A pay-as-you-go subscription."
    ],
    "respuesta": "A pay-as-you-go subscription.",
    "categoria": "administration_governance"
  },
  {
    "numero": 130,
    "pregunta": "Your Azure trial account expired last week. You are now unable to [create additional Microsoft Entra ID user accounts].",
    "opciones": [
      "No change is needed.",
      "Start an existing Azure virtual machine.",
      "Access your data stored in Azure.",
      "Access the Azure portal."
    ],
    "respuesta": "Start an existing Azure virtual machine.",
    "categoria": "administration_governance"
  },
  {
    "numero": 131,
    "pregunta": "Your company plans to purchase an Azure subscription, The company support policy states that the Azure environment must provide an option to access support engineers by phone or email. You need to recommend which support plan meets the support policy requirement. Solution: Recommend a Premier support plan. Does this meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 132,
    "pregunta": "Your company has 10 departments. The company plans to implement Azure environment. You need to ensure that each department can use a different payment option for the Azure services it consumes. What should you create for each department?",
    "opciones": [
      "A reservation.",
      "A subscription.",
      "A resource group.",
      "A container instance."
    ],
    "respuesta": "A subscription.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 133,
    "pregunta": "Which statement accurately describes the Modern Lifecycle Policy for Azure services?",
    "opciones": [
      "Microsoft provides mainstream support for a service for five years.",
      "Microsoft provides a minimum of 12 months notice before ending support for a service.",
      "After a service is made generally available, Microsoft provides support for the service for a minimum of four years.",
      "When a service is retired, you can purchase extended support for the service for up to five years."
    ],
    "respuesta": "Microsoft provides a minimum of 12 months notice before ending support for a service.",
    "categoria": "administration_governance"
  },
  {
    "numero": 134,
    "pregunta": "You can use Advisor recommendations in Azure to send email alerts when the cost of the current billing Azure subscription exceeds a specified limit.",
    "opciones": [
      "No change is needed.",
      "Access control (LAM).",
      "Budget alerts.",
      "Compliance."
    ],
    "respuesta": "Budget alerts.",
    "categoria": "administration_governance"
  },
  {
    "numero": 135,
    "pregunta": "To implement a hybrid cloud model, a company must first have a private cloud.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 136,
    "pregunta": "A company can extend the computing resources of its internal network by using a hybrid cloud.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 137,
    "pregunta": "In a public cloud model, only guest users at your company can access the resources in the cloud.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 138,
    "pregunta": "You have an on-premises network that contains several servers. You plan to migrate all the servers to Azure. You need to recommend a solution to ensure that some of the servers are available if a single Azure data center goes offline for an extended period. What should you include in the recommendation?",
    "opciones": [
      "Fault tolerance.",
      "Elasticity.",
      "Scalability.",
      "Low latency."
    ],
    "respuesta": "Fault tolerance.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 139,
    "pregunta": "An organization that hosts its infrastructure [in a private cloud] can close its data center.",
    "opciones": [
      "No change is needed.",
      "In a hybrid cloud.",
      "In the public cloud.",
      "On a Hyper-V host."
    ],
    "respuesta": "In the public cloud.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 140,
    "pregunta": "What are two characteristics of the public cloud?",
    "opciones": [
      "Dedicated hardware.",
      "Unsecured connections.",
      "Limited storage.",
      "Metered pricing.",
      "Self-service management."
    ],
    "respuesta": [
      "Metered pricing.",
      "Self-service management."
    ],
    "categoria": "cloud_concepts"
  },
  {
    "numero": 141,
    "pregunta": "Your company plans to migrate all its data and resources to Azure. The company migration plan states that only Platform as a Service (PaaS) solutions must be used in Azure. You need to deploy an Azure environment that meets the company migration plan. Solution: You create an Azure App Service and Azure virtual machines that have Microsoft SQL Server installed. Does this meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 142,
    "pregunta": "Your company hosts an accounting application named App1 that is used by all the customers of the company. App1 has low usage during the first three weeks of each month and very high usage during the last week of each month. Which benefit of Azure Cloud Services supports cost management for this type of usage pattern?",
    "opciones": [
      "High availability.",
      "High latency.",
      "Elasticity.",
      "Load balancing."
    ],
    "respuesta": "Elasticity.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 143,
    "pregunta": "You plan to deploy several Azure virtual machines. You need to ensure that the services running on the virtual machines are available if a single data center fails. Solution: You deploy the virtual machines to two or more scale sets. Does this meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "architecture_services"
  },
  {
    "numero": 144,
    "pregunta": "You plan to provision Infrastructure as a Service (IaaS) resources in Azure. Which resource is an example of IaaS?",
    "opciones": [
      "An Azure web app.",
      "An Azure virtual machine.",
      "An Azure logic app.",
      "An Azure SQL database."
    ],
    "respuesta": "An Azure virtual machine.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 145,
    "pregunta": "A team of developers at your company plans to deploy, and then remove, 50 customized virtual machines each week. Thirty of the virtual machines run Windows Server 2016 and 20 of the virtual machines run Ubuntu Linux. You need to recommend which Azure service will minimize the administrative effort required to deploy and remove the virtual machines. What should you recommend?",
    "opciones": [
      "Azure Reserved Virtual Machines (VM) Instances.",
      "Azure virtual machine scale sets.",
      "Azure DevTest Labs.",
      "Microsoft Managed Desktop."
    ],
    "respuesta": "Azure DevTest Labs.",
    "categoria": "architecture_services"
  },
  {
    "numero": 146,
    "pregunta": "One of the benefits of Azure Synapse Analytics is that [high availability] is built into the platform.",
    "opciones": [
      "No change is needed.",
      "Automatic scaling.",
      "Data compression.",
      "Versioning."
    ],
    "respuesta": "No change is needed.",
    "categoria": "architecture_services"
  },
  {
    "numero": 147,
    "pregunta": "Match the Azure services to the correct descriptions.",
    "opciones": [
      "Provide operating system virtualization: Azure App Service. Provide portable environment for virtualized applications: Azure virtual machines. Used to build, deploy, and scale web apps: Azure Container Instances. Provide a platform for serverless code: Azure Functions.",
      "Provide operating system virtualization: Azure Functions. Provide portable environment for virtualized applications: Azure virtual machines. Used to build, deploy, and scale web apps: Azure Container Instances. Provide a platform for serverless code: Azure App Service.",
      "Provide operating system virtualization: Azure virtual machines. Provide portable environment for virtualized applications: Azure Container Instances. Used to build, deploy, and scale web apps: Azure App Service. Provide a platform for serverless code: Azure Functions.",
      "Provide operating system virtualization: Azure virtual machines. Provide portable environment for virtualized applications: Azure Functions. Used to build, deploy, and scale web apps: Azure App Service. Provide a platform for serverless code: Azure Container Instances."
    ],
    "respuesta": "Provide operating system virtualization: Azure virtual machines. Provide portable environment for virtualized applications: Azure Container Instances. Used to build, deploy, and scale web apps: Azure App Service. Provide a platform for serverless code: Azure Functions.",
    "imagen": "question147.png",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 148,
    "pregunta": "An Azure administrator plans to run a PowerShell script that creates Azure resources. You need to recommend which computer configuration to use to run the script. Solution: Run the script from a computer that runs macOS and has PowerShell Core 6.0 installed. Does this meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 149,
    "pregunta": "You have an Azure environment that contains 10 virtual networks and 100 virtual machines. You need to limit the amount of inbound traffic to all the Azure virtual networks. What should you create?",
    "opciones": [
      "One application security group (ASG).",
      "10 virtual network gateways.",
      "10 Azure ExpressRoute circuits.",
      "One Azure firewall."
    ],
    "respuesta": "One Azure firewall.",
    "categoria": "architecture_services"
  },
  {
    "numero": 150,
    "pregunta": "You have an on-premises application that sends email notifications automatically based on a rule. You plan to migrate the application to Azure. You need to recommend a serverless computing solution for the application. What should you include in the recommendation?",
    "opciones": [
      "A web app.",
      "A server image in Azure Marketplace.",
      "A logic app.",
      "An API app."
    ],
    "respuesta": "A logic app.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 151,
    "pregunta": "You have an application that is comprised of an Azure web app that has a Service Level Agreement (SLA) of 99.95 percent and an Azure SQL database that has an SLA of 99.99 percent. The composite SLA for the application is [the product of both SLAs, which equals 99.94 percent].",
    "opciones": [
      "No change is needed.",
      "The lowest SLA associated to the application, which is 99.95 percent.",
      "The highest SLA associated to the application, which is 99.99 percent.",
      "The difference between the two SLAs, which is 0.05 percent."
    ],
    "respuesta": "No change is needed.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 152,
    "pregunta": "You have an Azure subscription named Subscription1. You sign in to the Azure portal and create a resource group named RG1. From Azure documentation, you have the following command that creates a virtual machine named VM1. `az vm create --resource-group RG1 --name VM1 --image UbuntuLTS --generate-ssh-keys`. You need to create VM1 in Subscription1 by using the command. Solution: From a computer that runs Windows 10, install Azure CLI. From PowerShell, sign in to Azure and then run the command. Does this meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "architecture_services"
  },
  {
    "numero": 153,
    "pregunta": "You have an Azure subscription named Subscription1. You sign in to the Azure portal and create a resource group named RG1. From Azure documentation, you have the following command that creates a virtual machine named VM1. `az vm create --resource-group RG1 --name VM1 --image UbuntuLTS --generate-ssh-keys`. You need to create VM1 in Subscription1 by using the command. Solution: From a computer that runs Windows 10, install Azure CLI. From a command prompt, sign in to Azure and then run the command. Does this meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "architecture_services"
  },
  {
    "numero": 154,
    "pregunta": "You have an Azure environment. You need to create a new Azure virtual machine from a tablet that runs the Android operating system. Solution: You use PowerShell in Azure Cloud Shell. Does this meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 155,
    "pregunta": "[Azure Databricks] is an Apache Spark-based analytics service.",
    "opciones": [
      "No change is needed.",
      "Azure Data Factory.",
      "Azure DevOps.",
      "Azure HDInsight."
    ],
    "respuesta": "No change is needed.",
    "categoria": "architecture_services"
  },
  {
    "numero": 156,
    "pregunta": "Azure Site Recovery provides [fault tolerance] for virtual machines.",
    "opciones": [
      "No change is needed.",
      "Disaster recovery.",
      "Elasticity.",
      "High availability."
    ],
    "respuesta": "Disaster recovery.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 157,
    "pregunta": "An Availability Zone in Azure has physically separate locations [across two continents].",
    "opciones": [
      "No change is needed.",
      "Within a single Azure region.",
      "Within multiple Azure regions.",
      "Within a single Azure datacenter."
    ],
    "respuesta": "Within a single Azure region.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 158,
    "pregunta": "Your company plans to migrate all on-premises data to Azure. You need to identify whether Azure complies with the company regional requirements. What should you use?",
    "opciones": [
      "The Knowledge Center.",
      "Azure Marketplace.",
      "The MyApps portal.",
      "The Trust Center."
    ],
    "respuesta": "The Trust Center.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 159,
    "pregunta": "Azure Key Vault is used to store secrets for [Microsoft Entra ID user accounts].",
    "opciones": [
      "No change is needed.",
      "Microsoft Entra ID administrative accounts.",
      "Personally Identifiable Information (PII).",
      "Server applications."
    ],
    "respuesta": "Server applications.",
    "categoria": "administration_governance"
  },
  {
    "numero": 160,
    "pregunta": "After you create a virtual machine, you need to modify the [Network Security Group (NSG)] to allow connections to TCP port 8080 on the virtual machine.",
    "opciones": [
      "No change is needed.",
      "Virtual network gateway.",
      "Virtual network.",
      "Route table."
    ],
    "respuesta": "No change is needed.",
    "categoria": "architecture_services"
  },
  {
    "numero": 161,
    "pregunta": "Your Azure environment contains multiple Azure virtual machines. You need to ensure that a virtual machine named VM1 is accessible from the Internet over HTTP. Solution: You modify a Network Security Group (NSG). Does this meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "architecture_services"
  },
  {
    "numero": 162,
    "pregunta": "Your Azure environment contains multiple Azure virtual machines. You need to ensure that a virtual machine named VM1 is accessible from the Internet over HTTP. Solution: You modify a DDoS protection plan. Does this meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "architecture_services"
  },
  {
    "numero": 163,
    "pregunta": "[Resource groups] provide organizations with the ability to manage the compliance of Azure resources across multiple subscriptions.",
    "opciones": [
      "No change is needed.",
      "Management groups.",
      "Azure policies.",
      "Azure App Service plans."
    ],
    "respuesta": "Azure policies.",
    "categoria": "administration_governance"
  },
  {
    "numero": 164,
    "pregunta": "Your network contains an Active Directory forest. The forest contains 5,000 user accounts. Your company plans to migrate all network resources to Azure and to decommission the on-premises data center. You need to recommend a solution to minimize the impact on users after the planned migration. What should you recommend?",
    "opciones": [
      "Implement Azure Multi-Factor Authentication (MFA).",
      "Sync all the Active Directory user accounts to Microsoft Entra ID.",
      "Instruct all users to change their password.",
      "Create a guest user account in Microsoft Entra ID for each user."
    ],
    "respuesta": "Sync all the Active Directory user accounts to Microsoft Entra ID.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 165,
    "pregunta": "What should you use to evaluate whether your company Azure environment meets regulatory requirements?",
    "opciones": [
      "The Knowledge Center website.",
      "The Advisor blade from the Azure portal.",
      "Compliance Manager from the Service Trust Portal.",
      "The Security Center blade from the Azure portal."
    ],
    "respuesta": "Compliance Manager from the Service Trust Portal.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 166,
    "pregunta": "The [Microsoft Online Services Privacy Statement] explains what data Microsoft processes, how Microsoft processes the data, and the purpose of processing the data.",
    "opciones": [
      "No change is needed.",
      "Microsoft Online Services Terms.",
      "Microsoft Online Service Level Agreement.",
      "Online Subscription Agreement for Microsoft Azure."
    ],
    "respuesta": "No change is needed.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 167,
    "pregunta": "If Microsoft plans to end support for an Azure service that does NOT have a successor service, Microsoft will provide notification at least [12 months] before.",
    "opciones": [
      "No change is needed.",
      "6 months.",
      "90 days.",
      "30 days."
    ],
    "respuesta": "No change is needed.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 168,
    "pregunta": "Your company has an Azure subscription that contains the following unused resources: 20 user accounts in Microsoft Entra ID. Five groups in Microsoft Entra ID. 10 public IP addresses. 10 network interfaces. You need to reduce the Azure costs for the company. Solution: You remove the unused network interfaces. Does this meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 169,
    "pregunta": "Your company has an Azure subscription that contains the following unused resources: 20 user accounts in Microsoft Entra ID. Five groups in Microsoft Entra ID. 10 public IP addresses 10. network interfaces. You need to reduce the Azure costs for the company. Solution: You remove the unused public IP addresses. Does this meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 170,
    "pregunta": "Your company has an Azure subscription that contains the following unused resources: 20 user accounts in Microsoft Entra ID. Five groups in Microsoft Entra ID. 10 public IP addresses 10. network interfaces. You need to reduce the Azure costs for the company. Solution: You remove the unused user accounts. Does this meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 171,
    "pregunta": "A support plan solution that gives you best practice information, health status and notifications, and 24/7 access to billing information at the lowest possible cost is a [Standard] support plan.",
    "opciones": [
      "No change is needed.",
      "Developer.",
      "Basic.",
      "Professional Direct."
    ],
    "respuesta": "Basic.",
    "categoria": "administration_governance"
  },
  {
    "numero": 172,
    "pregunta": "You can create an Azure support request from [support.microsoft.com].",
    "opciones": [
      "No change is needed.",
      "The Azure portal.",
      "The Knowledge Center.",
      "The Security & Compliance admin center."
    ],
    "respuesta": "The Azure portal.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 173,
    "pregunta": "Your company has an Azure subscription that contains the following unused resources: 20 user accounts in Microsoft Entra ID. Five groups in Microsoft Entra ID. 10 public IP addresses. 10 network interfaces. You need to reduce the Azure costs for the company. Solution: You remove the unused groups. Does this meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 174,
    "pregunta": "The Azure [Standard] support plan is the lowest cost option to receive 247 access to support engineers by phone.",
    "opciones": [
      "No change is needed.",
      "Developer.",
      "Basic.",
      "Professional Direct."
    ],
    "respuesta": "No change is needed.",
    "categoria": "administration_governance"
  },
  {
    "numero": 175,
    "pregunta": "All Azure services that are in public preview are [provided without any documentation].",
    "opciones": [
      "No change is needed.",
      "Only configurable from Azure CLI.",
      "Excluded from the Service Level Agreements.",
      "Only configurable from the Azure portal."
    ],
    "respuesta": "Excluded from the Service Level Agreements.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 176,
    "pregunta": "An Azure service is available to all Azure customers when it is in [public preview].",
    "opciones": [
      "No change is needed.",
      "Private preview.",
      "Development.",
      "An Enterprise Agreement (EA) subscription."
    ],
    "respuesta": "No change is needed.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 177,
    "pregunta": "Your company has an on-premises network with numerous servers, which they intend to migrate to Azure. You have been tasked with devising a plan that allows for the availability of a few of the servers, in the event that one of the Azure data centers becomes unavailable for a lengthy interval. Solution: You should include elasticity in your plan. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 178,
    "pregunta": "Your company has an on-premises network with numerous servers, which they intend to migrate to Azure. You have been tasked with devising a plan that allows for the availability of a few of the servers, in the event that one of the Azure data centers becomes unavailable for a lengthy interval. Solution: You should include scalability in your plan. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 179,
    "pregunta": "Your company has an on-premises network with numerous servers, which they intend to migrate to Azure. You have been tasked with devising a plan that allows for the availability of a few of the servers, in the event that one of the Azure data centers becomes unavailable for a lengthy interval. Solution: You should include fault tolerance in your plan. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 180,
    "pregunta": "You are tasked with deploying Azure virtual machines for your company. You need to make use of the appropriate cloud deployment solution. Solution: You should make use of Software as a Service (SaaS). Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 181,
    "pregunta": "You are tasked with deploying Azure virtual machines for your company. You need to make use of the appropriate cloud deployment solution. Solution: You should make use of Platform as a Service (PaaS). Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 182,
    "pregunta": "You are tasked with deploying Azure virtual machines for your company. You need to make use of the appropriate cloud deployment solution. Solution: You should make use of Infrastructure as a Service (IaaS). Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 183,
    "pregunta": "Your company has on-premises network includes a large number of servers. They would like to make extra resources available to their users, while keeping capital and operational overheads to a minimum. You are required to make recommendations that should be included in the overall solution. Solution: You should indorse the use of an added data center as part of the solution. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 184,
    "pregunta": "Your company has on-premises network includes a large number of servers. They would like to make extra resources available to their users, while keeping capital and operational overheads to a minimum. You are required to make recommendations that should be included in the overall solution. Solution: You should indorse the use of a hybrid cloud as part of the solution. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 185,
    "pregunta": "Your company has on-premises network includes a large number of servers. They would like to make extra resources available to their users, while keeping capital and operational overheads to a minimum. You are required to make recommendations that should be included in the overall solution. Solution: You should indorse the use of a private cloud as part of the solution. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 186,
    "pregunta": "Your company is planning to migrate all their virtual machines to an Azure pay-as-you-go subscription. The virtual machines are currently hosted on the Hyper-V hosts in a data center. You are required make sure that the intended Azure solution uses the correct expenditure model. Solution: You should recommend the use of the elastic expenditure model. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "architecture_services"
  },
  {
    "numero": 187,
    "pregunta": "Your company is planning to migrate all their virtual machines to an Azure pay-as-you-go subscription. The virtual machines are currently hosted on the Hyper-V hosts in a data center. You are required make sure that the intended Azure solution uses the correct expenditure model. Solution: You should recommend the use of the scalable expenditure model. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "architecture_services"
  },
  {
    "numero": 188,
    "pregunta": "Your company is planning to migrate all their virtual machines to an Azure pay-as-you-go subscription. The virtual machines are currently hosted on the Hyper-V hosts in a data center. You are required make sure that the intended Azure solution uses the correct expenditure model. Solution: You should recommend the use of the operational expenditure model. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "architecture_services"
  },
  {
    "numero": 189,
    "pregunta": "You are required to deploy an Artificial Intelligence (AI) solution in Azure. You want to make sure that you are able to build, test, and deploy predictive analytics for the solution. Solution: You should make use of Azure Cosmos DB. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "architecture_services"
  },
  {
    "numero": 190,
    "pregunta": "You are required to deploy an Artificial Intelligence (AI) solution in Azure. You want to make sure that you are able to build, test, and deploy predictive analytics for the solution. Solution: You should make use of Azure Logic Apps. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "architecture_services"
  },
  {
    "numero": 191,
    "pregunta": "You are required to deploy an Artificial Intelligence (AI) solution in Azure. You want to make sure that you are able to build, test, and deploy predictive analytics for the solution. Solution: You should make use of Azure Machine Learning Studio. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "architecture_services"
  },
  {
    "numero": 192,
    "pregunta": "Your company has infrastructure includes a number of business units that each need a large number of various Azure resources for everyday operation. The resources required by each business unit are identical. You are required to sanction a strategy to create Azure resources automatically. Solution: You recommend that the Azure API Management service be included in the strategy. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 193,
    "pregunta": "Your company has infrastructure includes a number of business units that each need a large number of various Azure resources for everyday operation. The resources required by each business unit are identical. You are required to sanction a strategy to create Azure resources automatically. Solution: You recommend that management groups be included in the strategy. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 194,
    "pregunta": "Your company has infrastructure includes a number of business units that each need a large number of various Azure resources for everyday operation. The resources required by each business unit are identical. You are required to sanction a strategy to create Azure resources automatically. Solution: You recommend that the Azure Resource Manager templates be included in the strategy. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 195,
    "pregunta": "You are tasked with deploying a critical LOB application, which will be installed on a virtual machine, to Azure. You are informed that the application deployment strategy should allow for a guaranteed availability of 99.99 percent. You need to make sure that the strategy requires as little virtual machines and availability zones as possible. Solution: You include two virtual machines and one availability zone in your strategy. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 196,
    "pregunta": "You are tasked with deploying a critical LOB application, which will be installed on a virtual machine, to Azure. You are informed that the application deployment strategy should allow for a guaranteed availability of 99.99 percent. You need to make sure that the strategy requires as little virtual machines and availability zones as possible. Solution: You include one virtual machine and two availability zones in your strategy. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 197,
    "pregunta": "You are tasked with deploying a critical LOB application, which will be installed on a virtual machine, to Azure. You are informed that the application deployment strategy should allow for a guaranteed availability of 99.99 percent. You need to make sure that the strategy requires as little virtual machines and availability zones as possible. Solution: You include two virtual machines and two availability zones in your strategy. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 198,
    "pregunta": "Your company has developers intend to deploy a large number of custom virtual machines on a weekly basis. They will also be removing these virtual machines during the same week it was deployed. Sixty percent of the virtual machines have Windows Server 2016 installed, while the other forty percent has Ubuntu Linux installed. You are required to make sure that the administrative effort, needed for this process, is reduced by employing a suitable Azure service. Solution: you recommend the use of Microsoft Managed Desktop. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "architecture_services"
  },
  {
    "numero": 199,
    "pregunta": "Your company has developers intend to deploy a large number of custom virtual machines on a weekly basis. They will also be removing these virtual machines during the same week it was deployed. Sixty percent of the virtual machines have Windows Server 2016 installed, while the other forty percent has Ubuntu Linux installed. You are required to make sure that the administrative effort, needed for this process, is reduced by employing a suitable Azure service. Solution: you recommend the use of Azure Reserved Virtual Machines (VM) Instances.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "architecture_services"
  },
  {
    "numero": 200,
    "pregunta": "Your company has developers intend to deploy a large number of custom virtual machines on a weekly basis. They will also be removing these virtual machines during the same week it was deployed. Sixty percent of the virtual machines have Windows Server 2016 installed, while the other forty percent has Ubuntu Linux installed. You are required to make sure that the administrative effort, needed for this process, is reduced by employing a suitable Azure service. Solution: you recommend the use of Azure DevTest Labs. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "architecture_services"
  },
  {
    "numero": 201,
    "pregunta": "Your company has virtual machines (VMs) hosted in Microsoft Azure. The VMs are located in a single Azure virtual network named VNet1. The company has users that work remotely. The remote workers require access to the VMs on VNet1. You need to provide access for the remote workers. What should you do?",
    "opciones": [
      "Configure a Site-to-Site (S2S) VPN.",
      "Configure a VNet-toVNet VPN.",
      "Configure a Point-to-Site (P2S) VPN.",
      "Configure DirectAccess on a Windows Server 2012 server VM.",
      "Configure a Multi-Site VPN."
    ],
    "respuesta": "Configure a Point-to-Site (P2S) VPN.",
    "categoria": "architecture_services"
  },
  {
    "numero": 202,
    "pregunta": "You have been informed by your superiors of the company has intentions to automate server deployment to Azure. There is, however, some concern that administrative credentials could be uncovered during this process. You are required to make sure that during the deployment, the administrative credentials are encrypted using a suitable Azure solution. Solution: You recommend the use of Microsoft Purview Information Protection. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 203,
    "pregunta": "You have been informed by your superiors of the company has intentions to automate server deployment to Azure. There is, however, some concern that administrative credentials could be uncovered during this process. You are required to make sure that during the deployment, the administrative credentials are encrypted using a suitable Azure solution. Solution: You recommend the use of Azure Key Vault. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 204,
    "pregunta": "You have been informed by your superiors of the company has intentions to automate server deployment to Azure. There is, however, some concern that administrative credentials could be uncovered during this process. You are required to make sure that during the deployment, the administrative credentials are encrypted using a suitable Azure solution. Solution: You recommend the use of Azure Multi-Factor Authentication (MFA). Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 205,
    "pregunta": "Your company has a Microsoft Entra ID environment. Users occasionally connect to Microsoft Entra ID via the Internet. You have been tasked with making sure that users who connect to Microsoft Entra ID via the internet from an unidentified IP address, are automatically encouraged to change passwords. Solution: You configure the use of Azure Key Vault. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 206,
    "pregunta": "Your company has a Microsoft Entra ID environment. Users occasionally connect to Microsoft Entra ID via the Internet. You have been tasked with making sure that users who connect to Microsoft Entra ID via the internet from an unidentified IP address, are automatically encouraged to change passwords. Solution: You configure the use of Microsoft Entra ID Protection. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 207,
    "pregunta": "Your company has a Microsoft Entra ID environment. Users occasionally connect to Microsoft Entra ID via the Internet. You have been tasked with making sure that users who connect to Microsoft Entra ID via the internet from an unidentified IP address, are automatically encouraged to change passwords. Solution: You configure the use of Microsoft Entra Privileged Identity Management. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 208,
    "pregunta": "You are planning a strategy to deploy numerous web servers and database servers to Azure. This strategy should allow for connection types between the web servers and database servers to be controlled. Solution: You include the Azure Service Bus in your strategy. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 209,
    "pregunta": "You are planning a strategy to deploy numerous web servers and database servers to Azure. This strategy should allow for connection types between the web servers and database servers to be controlled. Solution: You include network security groups (NSGs) in your strategy. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 210,
    "pregunta": "You are planning a strategy to deploy numerous web servers and database servers to Azure. This strategy should allow for connection types between the web servers and database servers to be controlled. Solution: You include a local network gateway in your strategy. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 211,
    "pregunta": "Your company has Active Directory forest includes thousands of user accounts. You have been informed that all network resources will be migrated to Azure. Thereafter, the on-premises data center will be retired. You are required to employ a strategy that reduces the effect on users, once the planned migration has been completed. Solution: You plan to require Azure Multi-Factor Authentication (MFA). Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 212,
    "pregunta": "Your company has Active Directory forest includes thousands of user accounts. You have been informed that all network resources will be migrated to Azure. Thereafter, the on-premises data center will be retired. You are required to employ a strategy that reduces the effect on users, once the planned migration has been completed. Solution: You plan to sync all the Active Directory user accounts to Microsoft Entra ID. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 213,
    "pregunta": "Your company has Active Directory forest includes thousands of user accounts. You have been informed that all network resources will be migrated to Azure. Thereafter, the on-premises data center will be retired. You are required to employ a strategy that reduces the effect on users, once the planned migration has been completed. Solution: You plan to enforce password change. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 214,
    "pregunta": "Your developers have created 10 web applications that must be host on Azure. You need to determine which Azure web tier plan to host the web apps. The web tier plan must meet the following requirements: The web apps will use custom domains. The web apps each require 10 GB of storage. The web apps must each run in dedicated compute instances. Load balancing between instances must be included. Costs must be minimized. Which web tier plan should you use?",
    "opciones": [
      "Standard.",
      "Basic.",
      "Free.",
      "Shared."
    ],
    "respuesta": "Basic.",
    "categoria": "administration_governance"
  },
  {
    "numero": 215,
    "pregunta": "You are currently trying to generate a number of managed Microsoft SQL Server instances in an Azure environment. During the process, you are presented with a notification informing you that the Azure subscription limits must be increased. You want to make sure that you can complete your task. Solution: You generate a service health alert. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 216,
    "pregunta": "You are currently trying to generate a number of managed Microsoft SQL Server instances in an Azure environment. During the process, you are presented with a notification informing you that the Azure subscription limits must be increased. You want to make sure that you can complete your task. Solution: You alter an Azure policy. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 217,
    "pregunta": "You are currently trying to generate a number of managed Microsoft SQL Server instances in an Azure environment. During the process, you are presented with a notification informing you that the Azure subscription limits must be increased. You want to make sure that you can complete your task. Solution: You generate a new support request. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 218,
    "pregunta": "You are planning to migrate a company to Azure. Each of the company has numerous divisions will have an administrator in place to manage the Azure resources used by their respective division. You want to make sure that the Azure deployment you employ allows for Azure to be segmented for the divisions, while keeping administrative effort to a minimum. Solution: You plan to make use of several Microsoft Entra ID directories. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 219,
    "pregunta": "You are planning to migrate a company to Azure. Each of the company has numerous divisions will have an administrator in place to manage the Azure resources used by their respective division. You want to make sure that the Azure deployment you employ allows for Azure to be segmented for the divisions, while keeping administrative effort to a minimum. Solution: You plan to make use of several resource groups. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 220,
    "pregunta": "You are planning to migrate a company to Azure. Each of the company has numerous divisions will have an administrator in place to manage the Azure resources used by their respective division. You want to make sure that the Azure deployment you employ allows for Azure to be segmented for the divisions, while keeping administrative effort to a minimum. Solution: You plan to make use of several subscriptions. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 221,
    "pregunta": "Your developers have created a portal web app for users in the Miami branch office. The web app will be publicly accessible and used by the Miami users to retrieve customer and product information. The web app is currently running in an on-premises test environment. You plan to host the web app on Azure. You need to determine which Azure web tier plan to host the web app. The web tier plan must meet the following requirements: The website will use the miami.weyland.com URL. The website will be deployed to two instances. SSL support must be included. The website requires 12 GB of storage. Costs must be minimized. Which web tier plan should you use?",
    "opciones": [
      "Standard.",
      "Basic.",
      "Free.",
      "Shared."
    ],
    "respuesta": "Standard.",
    "categoria": "administration_governance"
  },
  {
    "numero": 222,
    "pregunta": "Your company has datacenters in Los Angeles and New York. The company has a Microsoft Azure subscription. You are configuring the two datacenters as geo-clustered sites for site resiliency. You need to recommend an Azure storage redundancy option. You have the following data storage requirements: Data must be stored on multiple nodes. Data must be stored on nodes in separate geographic locations. Data can be read from the secondary location as well as from the primary location Which of the following Azure stored redundancy options should you recommend?",
    "opciones": [
      "Geo-redundant storage.",
      "Read-only geo-redundant storage.",
      "Zone-redundant storage.",
      "Locally redundant storage."
    ],
    "respuesta": "Read-only geo-redundant storage.",
    "categoria": "architecture_services"
  },
  {
    "numero": 223,
    "pregunta": "Your company has Azure subscription includes a Basic support plan. They would like to request an assessment of an Azure environment has design from Microsoft. This is, however, not supported by the existing plan. You want to make sure that the company subscribes to a support plan that allows this functionality, while keeping expenses to a minimum. Solution: You recommend that the company subscribes to the Standard support plan. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 224,
    "pregunta": "Your company has Azure subscription includes a Basic support plan. They would like to request an assessment of an Azure environment has design from Microsoft. This is, however, not supported by the existing plan. You want to make sure that the company subscribes to a support plan that allows this functionality, while keeping expenses to a minimum. Solution: You recommend that the company subscribes to the Professional Direct support plan. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 225,
    "pregunta": "Your company has Azure subscription includes a Basic support plan. They would like to request an assessment of an Azure environment has design from Microsoft. This is, however, not supported by the existing plan. You want to make sure that the company subscribes to a support plan that allows this functionality, while keeping expenses to a minimum. Solution: You recommend that the company subscribes to the Premier support plan. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 226,
    "pregunta": "A company that has numerous divisions is planning to deploy an Azure environment. The company would like each division has option to pay for the Azure services it utilizes, not be the same. You have been asked to recommend a solution to meet the requirements. Solution: You recommend that an Azure role be created for each division. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 227,
    "pregunta": "A company that has numerous divisions is planning to deploy an Azure environment. The company would like each division has option to pay for the Azure services it utilizes, not be the same. You have been asked to recommend a solution to meet the requirements. Solution: You recommend that an Azure policy be created for each division. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 228,
    "pregunta": "A company that has numerous divisions is planning to deploy an Azure environment. The company would like each division has option to pay for the Azure services it utilizes, not be the same. You have been asked to recommend a solution to meet the requirements. Solution: You recommend that a subscription be created for each division. Does the solution meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 229,
    "pregunta": "An Azure subscription can be associated to multiple Microsoft Entra ID tenants.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 230,
    "pregunta": "You can change the Microsoft Entra ID tenant to which an Azure subscription is associated.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 231,
    "pregunta": "When an Azure subscription expires, the associated Microsoft Entra ID tenant is deleted automatically.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 232,
    "pregunta": "A single Microsoft account can be used to manage multiple Azure subscriptions.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 233,
    "pregunta": "Two Azure subscriptions can be merged into a single subscription.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 234,
    "pregunta": "A company can use resources from multiple subscriptions.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 235,
    "pregunta": "Availability zones can be implemented in all Azure regions.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 236,
    "pregunta": "Only virtual machines that run Windows Server can be created in availability zones.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 237,
    "pregunta": "Availability zones are used to replicate data and applications to multiple regions.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 238,
    "pregunta": "You plan to create an Azure virtual machine. You need to identify which storage service must be used to store the unmanaged data disks of the virtual machine. What should you identify?",
    "opciones": [
      "Containers.",
      "File shares.",
      "Tables.",
      "Queues."
    ],
    "respuesta": "Containers.",
    "categoria": "architecture_services"
  },
  {
    "numero": 239,
    "pregunta": "You plan to implement an Azure database solution. You need to implement a database solution that meets the following requirements: Can add data concurrently from multiple regions. Can store JSON documents Which database service should you deploy?",
    "opciones": [
      "Azure Cosmos DB.",
      "SQL databases.",
      "Azure Database for MYSQL servers.",
      "Azure Database for PostgreSQL servers.",
      "Azure Database for NariaDB servers.",
      "SQL servers.",
      "SQL Data warehouses.",
      "Azure Database Migration Services.",
      "Azure Cache for Redis.",
      "SQL Server stretch databases.",
      "Data factories.",
      "SQL elastic pools.",
      "Virtual Clusters.",
      "Managed databases.",
      "Elastic Job agents.",
      "SQL managed instances."
    ],
    "respuesta": "Azure Cosmos DB.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 240,
    "pregunta": "All the Azure resources deployed to a resource group must use the same Azure region.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 241,
    "pregunta": "If you assign a tag to a resource group, all the Azure resources in that resource group are assigned to the same tag.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 242,
    "pregunta": "If you assign permissions for a user to manage a resource group, the user can manage all the Azure resources in that resource group.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 243,
    "pregunta": "You plan to deploy a critical line-of-business application to Azure. The application will run on an Azure virtual machine. You need to recommend a deployment solution for the application. The solution must provide a guaranteed availability of 99.99 percent. What is the minimum number of virtual machines and the minimum number of availability zones you should recommend for the deployment? Minimum number of virtual machines:",
    "opciones": [
      "1.",
      "2.",
      "3."
    ],
    "respuesta": "2.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 244,
    "pregunta": "You plan to deploy a critical line-of-business application to Azure. The application will run on an Azure virtual machine. You need to recommend a deployment solution for the application. The solution must provide a guaranteed availability of 99.99 percent. What is the minimum number of virtual machines and the minimum number of availability zones you should recommend for the deployment? Minimum number of availability zones:",
    "opciones": [
      "1.",
      "2.",
      "3."
    ],
    "respuesta": "2.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 245,
    "pregunta": "Data that is stored in an Azure Storage account automatically has at least three copies.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "architecture_services"
  },
  {
    "numero": 246,
    "pregunta": "All data that is copied to an Azure Storage account is backed up automatically to another Azure data center.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "architecture_services"
  },
  {
    "numero": 247,
    "pregunta": "An Azure Storage account can contain up to 2 TB of data and up to one million files.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "architecture_services"
  },
  {
    "numero": 248,
    "pregunta": "If you have Azure resources deployed to every region, you can implement availability zones in all the regions.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 249,
    "pregunta": "North America is represented by a single Azure region.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 250,
    "pregunta": "Every Azure region has multiple datacenters.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 251,
    "pregunta": "Data transfers between Azure services located in different Azure regions are always free.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 252,
    "pregunta": "You need to be notified when Microsoft plans to perform maintenance that can affect the resources deployed to an Azure subscription. What should you use?",
    "opciones": [
      "Azure Monitor.",
      "Azure Service Health.",
      "Azure Advisor.",
      "Microsoft Trust Center."
    ],
    "respuesta": "Azure Service Health.",
    "categoria": "administration_governance"
  },
  {
    "numero": 253,
    "pregunta": "A Windows Virtual Desktop session host can run Windows 10 only.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 254,
    "pregunta": "A Windows Virtual Desktop host pool that includes 20 session hosts supports a maximum of 20 simultaneous user connections.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 255,
    "pregunta": "Windows Virtual Desktop supports desktop and app virtualization.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 256,
    "pregunta": "[...] can calculate cost savings due to reduced electricity consumption as a result of migrating on-premises Microsoft SQL servers to Azure.",
    "opciones": [
      "The Azure Migrate: Server Assessment tool.",
      "The Azure Total Cost of Ownership (TCO) calculator.",
      "The Database Migration Assistant.",
      "The pricing calculator in Azure."
    ],
    "respuesta": "The Azure Total Cost of Ownership (TCO) calculator.",
    "categoria": "administration_governance"
  },
  {
    "numero": 257,
    "pregunta": "You can use Availability Zones in Azure to protect Azure virtual machines from a datacenter failure.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 258,
    "pregunta": "You can use Availability Zones in Azure to protect Azure virtual machines from a region failure.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 259,
    "pregunta": "You can use Availability Zones in Azure to protect Azure managed disks from a datacenter failure.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 260,
    "pregunta": "An Azure subscription can have multiple account administrators.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 261,
    "pregunta": "An Azure subscription can be managed by using a Microsoft account only.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 262,
    "pregunta": "An Azure resource group can contain multiple Azure subscriptions.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 263,
    "pregunta": "To use Microsoft Entra ID credentials to sign in to a computer that runs Windows 10, the computer must be joined to Microsoft Entra ID.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 264,
    "pregunta": "Users in Microsoft Entra ID are organized by using resource groups.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 265,
    "pregunta": "Microsoft Entra ID groups support dynamic membership rules.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 266,
    "pregunta": "You plan to deploy several Azure virtual machines. You need to ensure that the services running on the virtual machines remain available if a single data center fails. What are two possible solutions?",
    "opciones": [
      "Deploy the virtual machines to two or more availability zones.",
      "Deploy the virtual machines to two or more resource groups.",
      "Deploy the virtual machines to a scale set.",
      "Deploy the virtual machines to two or more regions."
    ],
    "respuesta": [
      "Deploy the virtual machines to two or more availability zones.",
      "Deploy the virtual machines to two or more regions."
    ],
    "categoria": "architecture_services"
  },
  {
    "numero": 267,
    "pregunta": "Azure Monitor can monitor the performance of on-premises computers.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 268,
    "pregunta": "Azure Monitor can send alerts to Microsoft Entra ID security groups.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 269,
    "pregunta": "Azure Monitor can trigger alerts based on data in an Azure Log Analytics workspace.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "architecture_services"
  },
  {
    "numero": 270,
    "pregunta": "From Azure Service Health, an administrator can view the health of all the services in an Azure environment.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 271,
    "pregunta": "From Azure Service Health, an administrator can create a rule to be alerted if an Azure service fails.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 272,
    "pregunta": "From Azure Service Health, an administrator can prevent a service failure.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 273,
    "pregunta": "You need to identify which blades in the Azure portal must be used to perform the following task: Monitor the health of Azure services.",
    "opciones": [
      "Monitor.",
      "Subscriptions.",
      "Marketplace.",
      "Advisor."
    ],
    "respuesta": "Monitor.",
    "categoria": "administration_governance"
  },
  {
    "numero": 274,
    "pregunta": "You need to identify which blades in the Azure portal must be used to perform the following task: Browse available virtual machine images.",
    "opciones": [
      "Monitor.",
      "Subscriptions.",
      "Marketplace.",
      "Advisor."
    ],
    "respuesta": "Marketplace.",
    "categoria": "architecture_services"
  },
  {
    "numero": 275,
    "pregunta": "You need to identify which blades in the Azure portal must be used to perform the following task: View security recommendations.",
    "opciones": [
      "Monitor.",
      "Subscriptions.",
      "Marketplace.",
      "Advisor."
    ],
    "respuesta": "Advisor.",
    "categoria": "administration_governance"
  },
  {
    "numero": 276,
    "pregunta": "Azure Advisor can generate a list of Azure virtual machines that are protected by Azure Backup.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "architecture_services"
  },
  {
    "numero": 277,
    "pregunta": "If you implement the security recommendations provided by Azure Advisor, your company secure score will decrease.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 278,
    "pregunta": "To maintain Microsoft support, you must implement the security recommendations provided by Azure Advisor within a period of 30 days.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 279,
    "pregunta": "What can you use to automatically send an alert if an administrator stops an Azure virtual machine?",
    "opciones": [
      "Azure Advisor.",
      "Azure Service Health.",
      "Azure Monitor.",
      "Azure Network Watcher."
    ],
    "respuesta": "Azure Monitor.",
    "categoria": "architecture_services"
  },
  {
    "numero": 280,
    "pregunta": "You have an Azure environment. You need to create a new Azure virtual machine from a tablet that runs the Android operating system. What are three possible solutions?",
    "opciones": [
      "Use Bash in Azure Cloud Shell.",
      "Use PowerShell in Azure Cloud Shell.",
      "Use the PowerApps portal.",
      "Use the Security & Compliance admin center.",
      "Use the Azure portal."
    ],
    "respuesta": [
      "Use Bash in Azure Cloud Shell.",
      "Use PowerShell in Azure Cloud Shell.",
      "Use the Azure portal."
    ],
    "categoria": "architecture_services"
  },
  {
    "numero": 281,
    "pregunta": "Azure Advisor provides recommendations on how to improve the security of a Microsoft Entra ID environment.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 282,
    "pregunta": "Azure Advisor provides recommendations on how to reduce the cost of running Azure virtual machines.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "architecture_services"
  },
  {
    "numero": 283,
    "pregunta": "Azure Advisor provides recommendations on how to configure the network settings on Azure virtual machines.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "architecture_services"
  },
  {
    "numero": 284,
    "pregunta": "Several support engineers plan to manage Azure by using the Computer1-Windows 10. You need to identify which Azure management tools can be used.",
    "opciones": [
      "The Azure CLI and the Azure portal.",
      "The Azure portal and Azure PowerShell.",
      "The Azure CLI and Azure PowerShell.",
      "The Azure CLI, the Azure portal, and Azure PowerShell."
    ],
    "respuesta": "The Azure CLI, the Azure portal, and Azure PowerShell.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 285,
    "pregunta": "Several support engineers plan to manage Azure by using the Computer2-Ubuntu. You need to identify which Azure management tools can be used.",
    "opciones": [
      "The Azure CLI and the Azure portal.",
      "The Azure portal and Azure PowerShell.",
      "The Azure CLI and Azure PowerShell.",
      "The Azure CLI, the Azure portal, and Azure PowerShell."
    ],
    "respuesta": "The Azure CLI, the Azure portal, and Azure PowerShell.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 286,
    "pregunta": "Several support engineers plan to manage Azure by using the Computer3-MacOS Mojave. You need to identify which Azure management tools can be used.",
    "opciones": [
      "The Azure CLI and the Azure portal.",
      "The Azure portal and Azure PowerShell.",
      "The Azure CLI and Azure PowerShell.",
      "The Azure CLI, the Azure portal, and Azure PowerShell."
    ],
    "respuesta": "The Azure CLI, the Azure portal, and Azure PowerShell.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 287,
    "pregunta": "You can access Compliance Manager from the [...].",
    "opciones": [
      "Microsoft Entra ID admin center.",
      "Azure portal.",
      "Microsoft 365 Admin Center.",
      "Microsoft Service Trust Portal."
    ],
    "respuesta": "Microsoft 365 Admin Center.",
    "categoria": "administration_governance"
  },
  {
    "numero": 288,
    "pregunta": "An Azure administrator plans to run a PowerShell script that creates Azure resources. You need to recommend which computer configuration to use to run the script. Which three computers can run the script?",
    "opciones": [
      "A computer that runs macOS and has PowerShell Core 6.0 installed.",
      "A computer that runs Windows 10 and has the Azure PowerShell module installed.",
      "A computer that runs Linux and has the Azure PowerShell module installed.",
      "A computer that runs Linux and has the Azure CLI tools installed.",
      "A computer that runs Chrome OS and uses Azure Cloud Shell."
    ],
    "respuesta": [
      "A computer that runs macOS and has PowerShell Core 6.0 installed.",
      "A computer that runs Windows 10 and has the Azure PowerShell module installed.",
      "A computer that runs Chrome OS and uses Azure Cloud Shell."
    ],
    "categoria": "cloud_concepts"
  },
  {
    "numero": 289,
    "pregunta": "Azure Firewall will encrypt all the network traffic sent from Azure the Internet.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 290,
    "pregunta": "A Network Security Group (NSG) will encrypt all the network traffic sent from Azure to the Internet.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 291,
    "pregunta": "Azure virtual machines that run Windows Server 2016 can encrypt network traffic sent to the Internet.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "architecture_services"
  },
  {
    "numero": 292,
    "pregunta": "Microsoft Defender for Cloud can monitor Azure resources and on-premises resources.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 293,
    "pregunta": "All Microsoft Defender for Cloud features are free.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 294,
    "pregunta": "From Microsoft Defender for Cloud, you can download a Regulatory Compliance report.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 295,
    "pregunta": "You plan to implement several security services for an Azure environment. You need to identify which Azure services must be used to meet the following security requirements: Monitor threats by using sensors.",
    "opciones": [
      "Azure Monitor.",
      "Microsoft Defender for Cloud.",
      "Microsoft Entra ID Identity Protection.",
      "Microsoft Defender for Identity."
    ],
    "respuesta": "Microsoft Defender for Identity.",
    "categoria": "administration_governance"
  },
  {
    "numero": 296,
    "pregunta": "You plan to implement several security services for an Azure environment. You need to identify which Azure services must be used to meet the following security requirements: Enforce Azure Multi-Factor Authentication (MFA) based on a condition.",
    "opciones": [
      "Azure Monitor.",
      "Microsoft Defender for Cloud.",
      "Microsoft Entra ID Identity Protection.",
      "Microsoft Defender for Identity."
    ],
    "respuesta": "Microsoft Entra ID Identity Protection.",
    "categoria": "administration_governance"
  },
  {
    "numero": 297,
    "pregunta": "Your Azure environment contains multiple Azure virtual machines. You need to ensure that a virtual machine named VM1 is accessible from the Internet over HTTP. What are two possible solutions?",
    "opciones": [
      "Modify an Azure Traffic Manager profile.",
      "Modify a Network Security Group (NSG).",
      "Modify a DDoS protection plan.",
      "Modify an Azure firewall."
    ],
    "respuesta": [
      "Modify a Network Security Group (NSG).",
      "Modify an Azure firewall."
    ],
    "categoria": "architecture_services"
  },
  {
    "numero": 298,
    "pregunta": "You can enable Just In Time (JIT) VM access by using [...].",
    "opciones": [
      "Azure Bastion.",
      "Azure Firewall.",
      "Azure Front Door.",
      "Microsoft Defender for Cloud."
    ],
    "respuesta": "Microsoft Defender for Cloud.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 299,
    "pregunta": "You can associate a Network Security Group (NSG) to a virtual network subnet.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "architecture_services"
  },
  {
    "numero": 300,
    "pregunta": "You can associate a Network Security Group (NSG) to a virtual network.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "architecture_services"
  },
  {
    "numero": 301,
    "pregunta": "You can associate a Network Security Group (NSG) to a network interface.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 302,
    "pregunta": "After you create a virtual machine, you need to modify to allow connections to TCP port 8080 on the virtual machine [...].",
    "opciones": [
      "Network Security Group (NSG).",
      "Virtual network gateway.",
      "Virtual network.",
      "Route table."
    ],
    "respuesta": "Network Security Group (NSG).",
    "categoria": "architecture_services"
  },
  {
    "numero": 303,
    "pregunta": "You can create custom Azure roles to control access to resources.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 304,
    "pregunta": "A user account can be assigned to multiple Azure roles.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 305,
    "pregunta": "A resource group can have the Owner role assigned to multiple users.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 306,
    "pregunta": "You need to collect and automatically analyze security events from Microsoft Entra ID. What should you use?",
    "opciones": [
      "Azure Sentinel.",
      "Azure Synapse Analytics.",
      "Microsoft Entra Connect.",
      "Azure Key Vault."
    ],
    "respuesta": "Azure Sentinel.",
    "categoria": "administration_governance"
  },
  {
    "numero": 307,
    "pregunta": "From [...] you can view which user turned off a specific virtual machine during the last 14 days.",
    "opciones": [
      "Azure Access Control IAM.",
      "Azure Event Hubs.",
      "Azure Activity Log.",
      "Azure Service Health."
    ],
    "respuesta": "Azure Activity Log.",
    "categoria": "architecture_services"
  },
  {
    "numero": 308,
    "pregunta": "Which Azure service can you use as a security information and event management (SIEM) solution?",
    "opciones": [
      "Azure Analysis Services.",
      "Azure Sentinel.",
      "Microsoft Purview Information Protection.",
      "Azure Cognitive Services."
    ],
    "respuesta": "Azure Sentinel.",
    "categoria": "administration_governance"
  },
  {
    "numero": 309,
    "pregunta": "Your company implements [Azure policies] to automatically add a watermark to Microsoft Word documents that contain credit card information.",
    "opciones": [
      "No change is needed.",
      "DDoS protection.",
      "Microsoft Purview Information Protection.",
      "Microsoft Entra ID Identity Protection."
    ],
    "respuesta": "Microsoft Purview Information Protection.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 310,
    "pregunta": "You have an Azure virtual network named VNET1 in a resource group named RG1. You assign the Azure Policy definition of Not Allowed Resource Type and specify that virtual networks are not an allowed resource type in RG1. VNET1 [...].",
    "opciones": [
      "is deleted automatically.",
      "is moved automatically to another resource group.",
      "continues to function normally.",
      "is now a read-only object."
    ],
    "respuesta": "continues to function normally.",
    "categoria": "architecture_services"
  },
  {
    "numero": 311,
    "pregunta": "You can create Group Polices in Microsoft Entra ID.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 312,
    "pregunta": "You can join Windows 10 devices to Microsoft Entra ID.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 313,
    "pregunta": "You can join Android devices to Microsoft Entra ID.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 314,
    "pregunta": "The [...] explains what data Microsoft processes, how Microsoft processes the data, and the purpose of processing the data.",
    "opciones": [
      "Microsoft Online Services Privacy Statement.",
      "Microsoft Online Services Terms.",
      "Microsoft Online Service Level Agreement.",
      "Online Subscription Agreement for Microsoft Azure."
    ],
    "respuesta": "Microsoft Online Services Privacy Statement.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 315,
    "pregunta": "An Azure Policy initiative definition is a [...].",
    "opciones": [
      "collection of policy definitions.",
      "collection of Azure Policy definition assignments.",
      "group of Azure Blueprints definitions.",
      "group of role-based access control (RBAC) role assignments."
    ],
    "respuesta": "collection of policy definitions.",
    "categoria": "administration_governance"
  },
  {
    "numero": 316,
    "pregunta": "[...] provide organizations with the ability to manage the compliance of Azure resources across multiple subscriptions.",
    "opciones": [
      "Resource groups.",
      "Management groups.",
      "Azure policies.",
      "Azure App Service plans."
    ],
    "respuesta": "Azure policies.",
    "categoria": "administration_governance"
  },
  {
    "numero": 317,
    "pregunta": "General Data Protection Regulation (GDPR) defines data protection and privacy rules.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 318,
    "pregunta": "General Data Protection Regulation (GDPR) applies to companies that offer goods or services to individuals in the EU.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 319,
    "pregunta": "Azure can be used to build a General Data Protection Regulation (GDPR)-compliant infrastructure.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 320,
    "pregunta": "You can add an Azure Resource Manager template to an Azure blueprint.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 321,
    "pregunta": "You can assign an Azure blueprint to a resource group.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 322,
    "pregunta": "You can use Azure Blueprints to grant permissions to a resource.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 323,
    "pregunta": "Azure China is operated by Microsoft.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 324,
    "pregunta": "Azure Government is operated by Microsoft.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 325,
    "pregunta": "Azure Government is available only to US government agencies and their partners.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 326,
    "pregunta": "An Azure resource can have multiple Delete locks.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 327,
    "pregunta": "An Azure resource inherits locks from its resource group.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 328,
    "pregunta": "If an Azure resource has a Read-only lock, you can add a Delete lock to the resource.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 329,
    "pregunta": "Authorization to access Azure resources can be provided only to Microsoft Entra ID users.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 330,
    "pregunta": "Identities stored in Microsoft Entra ID, third-party cloud services, and on-premises Active Directory can be used to access Azure resources.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 331,
    "pregunta": "Azure has built-in authentication and authorization services that provide secure access to Azure resources.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 332,
    "pregunta": "Identities stored in an on-premises Active Directory can be synchronized to Microsoft Entra ID.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 333,
    "pregunta": "You can view your company regulatory compliance report from [...].",
    "opciones": [
      "Azure Advisor.",
      "Azure Analysis Services.",
      "Azure Monitor.",
      "Microsoft Defender for Cloud."
    ],
    "respuesta": "Microsoft Defender for Cloud.",
    "categoria": "administration_governance"
  },
  {
    "numero": 334,
    "pregunta": "Your company has an Azure subscription that contains resources in several regions. You need to ensure that administrators can only create resources in those regions. What should you use?",
    "opciones": [
      "A read-only lock.",
      "An Azure policy.",
      "A management group.",
      "A reservation."
    ],
    "respuesta": "An Azure policy.",
    "categoria": "administration_governance"
  },
  {
    "numero": 335,
    "pregunta": "Microsoft Entra ID requires the implementation of domain controllers on Azure virtual machines.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "architecture_services"
  },
  {
    "numero": 336,
    "pregunta": "Microsoft Entra ID provides authentication services for resources hosted in Azure and Microsoft 365.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 337,
    "pregunta": "Each user account in Microsoft Entra ID can be assigned only one license.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 338,
    "pregunta": "To implement an Azure Multi-Factor Authentication (MFA) solution, you must sync on-premises identities to the cloud.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 339,
    "pregunta": "Two valid methods for Azure Multi-Factor Authentication (MFA) are picture identification and a passport number.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 340,
    "pregunta": "You can configure the Microsoft Entra ID activity logs to appear in Azure Monitor.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 341,
    "pregunta": "From Azure Monitor, you can monitor resources across multiple Azure subscriptions.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 342,
    "pregunta": "From Azure Monitor, you can create alerts.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 343,
    "pregunta": "You create a resource group named RG1 in Azure Resource Manager. You need to prevent the accidental deletion of the resources in RG1. Which setting should you use?",
    "opciones": [
      "Quickstart.",
      "Resource costs.",
      "Deployments.",
      "Policies.",
      "Properties.",
      "Locks.",
      "Automation script."
    ],
    "respuesta": "Locks.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 344,
    "pregunta": "You have a resource group named RG1. You need to prevent the creation of virtual machines only in RG1. The solution must ensure that other objects can be created in RG1. What should you use?",
    "opciones": [
      "A lock.",
      "An Azure role.",
      "A tag.",
      "An Azure policy."
    ],
    "respuesta": "An Azure policy.",
    "categoria": "architecture_services"
  },
  {
    "numero": 345,
    "pregunta": "You have an Azure subscription and 100 Windows 10 devices. You need to ensure that only users whose devices have the latest security patches installed can access Microsoft Entra ID-integrated applications. What should you implement?",
    "opciones": [
      "A conditional access policy.",
      "Azure Bastion.",
      "Azure Firewall.",
      "Azure Policy."
    ],
    "respuesta": "A conditional access policy.",
    "categoria": "administration_governance"
  },
  {
    "numero": 346,
    "pregunta": "[...] enables users to authenticate to multiple applications by using single sign-on (SSO).",
    "opciones": [
      "Application security groups in Azure.",
      "Microsoft Entra ID.",
      "Azure Key Vault.",
      "Microsoft Defender for Cloud."
    ],
    "respuesta": "Microsoft Entra ID.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 347,
    "pregunta": "You deploy an Azure resource. The resource becomes unavailable for an extended period due to a service outage. Microsoft will [...].",
    "opciones": [
      "refund your bank account.",
      "migrate the resource to another subscription.",
      "credit your Azure account.",
      "send you a coupon code that you can redeem for Azure credits."
    ],
    "respuesta": "credit your Azure account.",
    "categoria": "administration_governance"
  },
  {
    "numero": 348,
    "pregunta": "Which task can you perform by using Azure Advisor?",
    "opciones": [
      "Integrate Active Directory and Microsoft Entra ID.",
      "Estimate the costs of an Azure solution.",
      "Confirm that Azure subscription security follows best practices.",
      "Evaluate which on-premises resources can be migrated to Azure."
    ],
    "respuesta": "Estimate the costs of an Azure solution.",
    "categoria": "administration_governance"
  },
  {
    "numero": 349,
    "pregunta": "If your company uses an Azure free account, you will only be able to use a subset of Azure services.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 350,
    "pregunta": "All Azure free accounts expire after a specific period.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 351,
    "pregunta": "You can create up to 10 Azure free accounts by using the same Microsoft account.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 352,
    "pregunta": "All Azure services in private preview must be accessed by using a separate Azure portal.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 353,
    "pregunta": "Azure services in public preview can be used in production environments.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 354,
    "pregunta": "Azure services in public preview are subject to a Service Level Agreement (SLA).",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 355,
    "pregunta": "A Standard support plan is included in an Azure free account.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 356,
    "pregunta": "Match the Azure services to the appropriate descriptions.",
    "opciones": [
      "Extends on-premises networks to the Microsoft cloud via a private connection: VPN gateway. Combines two or more Azure virtual networks into a single logical virtual network: ExpressRoute. Provides an encrypted connection from on-premises networks to Azure via a public network: Virtual network peering.",
      "Extends on-premises networks to the Microsoft cloud via a private connection: ExpressRoute. Combines two or more Azure virtual networks into a single logical virtual network: VPN gateway. Provides an encrypted connection from on-premises networks to Azure via a public network: Virtual network peering.",
      "Extends on-premises networks to the Microsoft cloud via a private connection: VPN gateway. Combines two or more Azure virtual networks into a single logical virtual network: Virtual network peering. Provides an encrypted connection from on-premises networks to Azure via a public network: ExpressRoute.",
      "Extends on-premises networks to the Microsoft cloud via a private connection: ExpressRoute. Combines two or more Azure virtual networks into a single logical virtual network: Virtual network peering. Provides an encrypted connection from on-premises networks to Azure via a public network: VPN gateway."
    ],
    "respuesta": "Extends on-premises networks to the Microsoft cloud via a private connection: ExpressRoute. Combines two or more Azure virtual networks into a single logical virtual network: Virtual network peering. Provides an encrypted connection from on-premises networks to Azure via a public network: VPN gateway.",
    "imagen": "question356.png",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 357,
    "pregunta": "Support from MSDN forums is only provided to companies that have a pay-as-you-go subscription.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 358,
    "pregunta": "A user who is assigned the Owner role can transfer ownership of an Azure subscription.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 359,
    "pregunta": "You can convert the Azure subscription of your company from Free Trial to Pay-As-You-Go.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 360,
    "pregunta": "With Azure Reservations, you pay less fer virtual machines than with pay as-you-go pricing.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "architecture_services"
  },
  {
    "numero": 361,
    "pregunta": "Two Azure virtual machines that use the B25 size have the same monthly costs.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "architecture_services"
  },
  {
    "numero": 362,
    "pregunta": "When an Azure virtual machine is stopped, you continue to pay storage costs for the virtual machine.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "architecture_services"
  },
  {
    "numero": 363,
    "pregunta": "How should you calculate the monthly uptime percentage? [...]  Maximum Available Minutes  100.",
    "opciones": [
      "Downtime in Minutes.",
      "Maximum Available Minutes.",
      "(Maximum Available Minutes-Downtime in Minutes)."
    ],
    "respuesta": "(Maximum Available Minutes-Downtime in Minutes).",
    "categoria": "administration_governance"
  },
  {
    "numero": 364,
    "pregunta": "How should you calculate the monthly uptime percentage? (Maximum Available Minutes-Downtime in Minutes)  [...]  100.",
    "opciones": [
      "60.",
      "1,440.",
      "Maximum Available Minutes."
    ],
    "respuesta": "Maximum Available Minutes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 365,
    "pregunta": "How should you calculate the monthly uptime percentage? (Maximum Available Minutes-Downtime in Minutes)  Maximum Available Minutes  [...].",
    "opciones": [
      "100.",
      "99.99.",
      "1.440."
    ],
    "respuesta": "100.",
    "categoria": "administration_governance"
  },
  {
    "numero": 366,
    "pregunta": "By creating additional resource groups in an Azure subscription, additional costs are incurred.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 367,
    "pregunta": "By copying several gigabits of data to Azure from an on-premises network over a VPN, additional data transfer costs are incurred.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "architecture_services"
  },
  {
    "numero": 368,
    "pregunta": "An Azure service is available to all Azure customers when it is in [...].",
    "opciones": [
      "Public preview.",
      "Private preview.",
      "Development.",
      "Development an Enterprise Agreement (EA) subscription."
    ],
    "respuesta": "Public preview.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 369,
    "pregunta": "Most Azure services are introduced in private preview before being introduced in public preview, and then in general availability.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 370,
    "pregunta": "Azure services in public preview can be managed only by using the Azure CLI.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 371,
    "pregunta": "The cost of an Azure service in private preview decreases when the service becomes generally available.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 372,
    "pregunta": "Your Azure trial account expired last week. You are now unable to [...].",
    "opciones": [
      "create additional Microsoft Entra ID user accounts.",
      "start an existing Azure virtual machine.",
      "access your data stored in Azure.",
      "access the Azure portal."
    ],
    "respuesta": "start an existing Azure virtual machine.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 373,
    "pregunta": "Your company plans to purchase an Azure subscription. The company has support policy states that the Azure environment must provide an option to access support engineers by phone or email. You need to recommend which support plan meets the support policy requirement. Solution: Recommend a Professional Direct support plan. Does this meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 374,
    "pregunta": "Your company has 10 departments. The company plans to implement an Azure environment. You need to ensure that each department can use a different payment option for the Azure services it consumes. What should you create for each department?",
    "opciones": [
      "A reservation.",
      "A subscription.",
      "A resource group.",
      "A container instance."
    ],
    "respuesta": "A subscription.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 375,
    "pregunta": "An Azure free account has a spending limit.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 376,
    "pregunta": "An Azure free account has a limit of 2TB of data that can be uploaded to Azure.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 377,
    "pregunta": "An Azure free account can contain an unlimited number of web apps.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 378,
    "pregunta": "An Azure service in private preview is released to all Azure customers.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 379,
    "pregunta": "An Azure service in public preview is released to all Azure customers.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 380,
    "pregunta": "An Azure service in general availability is released to a subset of Azure customers.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 381,
    "pregunta": "With a consumption-based plan, you pay a fixed rate for all data sent to or from virtual machines hosted in the cloud.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 382,
    "pregunta": "With a consumption-based plan, you reduce overall costs by paying only for extra capacity when it is required.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 383,
    "pregunta": "Serverless computing is an example of a consumption-based plan.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 384,
    "pregunta": "The cost of Azure resources can vary between regions.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 385,
    "pregunta": "An Azure Reservation is used to reserve server capacity at a specific data center.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 386,
    "pregunta": "You can stop an Azure SQL Database instance to decrease costs.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "architecture_services"
  },
  {
    "numero": 387,
    "pregunta": "You have an application that is comprised of an Azure web app that has a Service Level Agreement (SLA) of 99.95 percent and an Azure SQL database that has an SLA of 99.99 percent. The composite SLA for the application is [...].",
    "opciones": [
      "the product of both SLAS, which equals 99.94 percent.",
      "the lowest SLA associated to the application, which is 99.95 percent.",
      "the highest SLA associated to the application, which is 99.99 percent.",
      "the difference between the two SLAS, which is 0.05 percent."
    ],
    "respuesta": "the product of both SLAS, which equals 99.94 percent.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 388,
    "pregunta": "The Service Level Agreement (SLA) guaranteed uptime for paid Azure services is at least 99.9 percent.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 389,
    "pregunta": "Companies can increase the Service Level Agreement (SLA) guaranteed uptime by adding Azure resources to multiple regions.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 390,
    "pregunta": "Companies can increase the Service Level Agreement (SLA) guaranteed uptime by purchasing multiple subscriptions.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 391,
    "pregunta": "Match the Azure Services service to the correct description.",
    "opciones": [
      "A managed service that provides bidirectional communication between IoT devices and Azure: IoT Hub. A fully managed software as a service (SaaS) solution to connect, monitor, and manage IoT devices at scale: IoT Central. A software and hardware solution that provides communication and security features for IoT devices: Azure Sphere.",
      "A managed service that provides bidirectional communication between IoT devices and Azure: Azure Sphere. A fully managed software as a service (SaaS) solution to connect, monitor, and manage IoT devices at scale: IoT Hub. A software and hardware solution that provides communication and security features for IoT devices: IoT Central.",
      "A managed service that provides bidirectional communication between IoT devices and Azure: Azure Sphere. A fully managed software as a service (SaaS) solution to connect, monitor, and manage IoT devices at scale: IoT Central. A software and hardware solution that provides communication and security features for IoT devices: IoT Hub.",
      "A managed service that provides bidirectional communication between IoT devices and Azure: IoT Hub. A fully managed software as a service (SaaS) solution to connect, monitor, and manage IoT devices at scale: Azure Sphere. A software and hardware solution that provides communication and security features for IoT devices: IoT Central."
    ],
    "respuesta": "A managed service that provides bidirectional communication between IoT devices and Azure: IoT Hub. A fully managed software as a service (SaaS) solution to connect, monitor, and manage IoT devices at scale: IoT Central. A software and hardware solution that provides communication and security features for IoT devices: Azure Sphere.",
    "imagen": "question391.png",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 392,
    "pregunta": "You need to request that Microsoft increase a subscription quota limit for your company. Which blade should you use from the Azure portal?",
    "opciones": [
      "Create a resource.",
      "All services.",
      "Favorites.",
      "Dashboard.",
      "All resources.",
      "Resource groups.",
      "App Services.",
      "Function Apps.",
      "SQL databases.",
      "Azure Cosmos DB.",
      "Virtual machines.",
      "Load balancers.",
      "Help + support."
    ],
    "respuesta": "Help + support.",
    "categoria": "administration_governance"
  },
  {
    "numero": 393,
    "pregunta": "You can use in Azure to send email alerts when the cost of the current billing period for an Azure subscription exceeds a specified limit.",
    "opciones": [
      "Advisor recommendations.",
      "Access control (IAM).",
      "Budget alerts.",
      "Compliance."
    ],
    "respuesta": "Budget alerts.",
    "categoria": "administration_governance"
  },
  {
    "numero": 394,
    "pregunta": "From the Azure portal, you can distinguish between services that are generally available and services that are in public preview.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 395,
    "pregunta": "After an Azure service becomes generally available, the service is no longer updated with new features.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 396,
    "pregunta": "When you create Azure resources for a service in public preview, you must recreate the resources once the service becomes generally available.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 397,
    "pregunta": "When using an Azure ExpressRoute connection, inbound data traffic from an on-premises network to Azure is always free.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "architecture_services"
  },
  {
    "numero": 398,
    "pregunta": "Outbound data traffic from Azure to an on-premises network is always free.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 399,
    "pregunta": "Data traffic between Azure services within the same Azure region is always free.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 400,
    "pregunta": "Your company has an Azure subscription that contains the following unused resources: 20 user accounts in Microsoft Entra ID. Five groups in Microsoft Entra ID. 10 public IP addresses. 10 network interfaces. You need to reduce the Azure costs for the company. Which unused resources should you remove?",
    "opciones": [
      "The network interfaces.",
      "The public IP addresses.",
      "The groups.",
      "The user accounts."
    ],
    "respuesta": "The public IP addresses.",
    "categoria": "administration_governance"
  },
  {
    "numero": 401,
    "pregunta": "If an Azure virtual machine has a status of Stopped (deallocated), you will continue to pay for.",
    "opciones": [
      "Compute capacity.",
      "I/O operations.",
      "Networking.",
      "Storage."
    ],
    "respuesta": "Storage.",
    "categoria": "architecture_services"
  },
  {
    "numero": 402,
    "pregunta": "Storing 1 TB of data in Azure Blob storage will always cost the same, regardless of the Azure region in which the data is located.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "architecture_services"
  },
  {
    "numero": 403,
    "pregunta": "When you use a general-purpose v2 Azure Storage account, you are only charged for the amount of data that is stored. All read and write operations are free.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "architecture_services"
  },
  {
    "numero": 404,
    "pregunta": "Transferring data between Azure Storage accounts in different Azure regions is free.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "architecture_services"
  },
  {
    "numero": 405,
    "pregunta": "In Microsoft Entra ID Premium P2, at least 99.9 percent availability is guaranteed.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 406,
    "pregunta": "The Service Level Agreement (SLA) for Microsoft Entra ID Premium P2 is the same as the SLA for Microsoft Entra ID Free.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 407,
    "pregunta": "All paying Azure customers receive a credit if their monthly uptime percentage is below the guaranteed amount in the Service Level Agreement (SLA).",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 408,
    "pregunta": "Adding resource groups in an Azure subscription generates additional costs.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 409,
    "pregunta": "Copying 10 GB of data to Azure from an on-premises network over a VPN generates additional Azure data transfer costs.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "architecture_services"
  },
  {
    "numero": 410,
    "pregunta": "Copying 10 GB of data from Azure to an on-premises network over a VPN generates additional Azure data transfer costs.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "architecture_services"
  },
  {
    "numero": 411,
    "pregunta": "Each Azure subscription can contain multiple account administrators.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 412,
    "pregunta": "Each Azure subscription can be managed by using a Microsoft account only.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 413,
    "pregunta": "An Azure resource group contains multiple Azure subscriptions.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "administration_governance"
  },
  {
    "numero": 414,
    "pregunta": "Data that is stored in the Archive access tier of an Azure Storage account [...].",
    "opciones": [
      "can be accessed at any time by using azcopy.exe.",
      "can only be read by using Azure Backup.",
      "must be restored before the data can be accessed.",
      "must be rehydrated before the data can be accessed."
    ],
    "respuesta": "must be rehydrated before the data can be accessed.",
    "categoria": "architecture_services"
  },
  {
    "numero": 415,
    "pregunta": "You deploy an Azure resource. The resource becomes unavailable for an extended period due to a service outage. Microsoft will automatically [refund your bank account].",
    "opciones": [
      "No change is needed.",
      "Automatically migrate the resource to another subscription.",
      "Automatically credit your account.",
      "Send you a coupon code that you can redeem for Azure credits."
    ],
    "respuesta": "Automatically credit your account.",
    "categoria": "administration_governance"
  },
  {
    "numero": 416,
    "pregunta": "When you need to delegate permissions to several Azure virtual machines simultaneously, you must deploy the Azure virtual machines [to the same Azure region].",
    "opciones": [
      "No change is needed.",
      "By using the same Azure Resource Manager template.",
      "To the same resource group.",
      "To the same availability zone."
    ],
    "respuesta": "To the same resource group.",
    "categoria": "architecture_services"
  },
  {
    "numero": 417,
    "pregunta": "Azure Cosmos DB is an example of a [...] offering.",
    "opciones": [
      "Platform as a Service (PaaS).",
      "Infrastructure as a service (IaaS).",
      "Serverless.",
      "Software as a service (SaaS)."
    ],
    "respuesta": "Platform as a Service (PaaS).",
    "categoria": "architecture_services"
  },
  {
    "numero": 418,
    "pregunta": "The Microsoft Service Trust Portal can be accessed by using a Microsoft cloud services account.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 419,
    "pregunta": "Compliance Manager can be used to track your company regulatory compliance activities related to Microsoft cloud services.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 420,
    "pregunta": "The My Library feature can be used to save Microsoft Service Trust Portal documents and resources in a single location.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 421,
    "pregunta": "Your company plans to migrate all its data and resources to Azure. The company migration plan states that only Platform as a Service (PaaS) solutions must be used in Azure. You need to deploy an Azure environment that supports the planned migration. Solution: You create an Azure App Service and Azure Storage accounts. Does this meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 422,
    "pregunta": "Data that is stored in the Archive access tier of an Azure Storage account [can be access at any time by using azcopy.exe].",
    "opciones": [
      "No change is needed.",
      "can only be read by using Azure Backup.",
      "must be restored before the data can be accessed.",
      "must be rehydrated before the data can be accessed."
    ],
    "respuesta": "must be rehydrated before the data can be accessed.",
    "categoria": "architecture_services"
  },
  {
    "numero": 423,
    "pregunta": "To implement a hybrid cloud model, a company must always migrate from a private cloud model.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 424,
    "pregunta": "A company can extend the computing resources of its internal network by using the public cloud.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 425,
    "pregunta": "Azure DevOps Services allows developers to deploy or update applications to Azure using Continuous Integration/Continuous Delivery (CI/CD) pipelines.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "architecture_services"
  },
  {
    "numero": 426,
    "pregunta": "Azure DevOps Services includes a Git repository for developers to store code.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "architecture_services"
  },
  {
    "numero": 427,
    "pregunta": "Azure DevOps Services can be used to build and host web apps.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "architecture_services"
  },
  {
    "numero": 428,
    "pregunta": "You plan to deploy 20 virtual machines to an Azure environment. To ensure that a virtual machine named VM1 cannot connect to the other virtual machines, VM1 must [be deployed to a separate virtual network].",
    "opciones": [
      "No change is needed.",
      "run a different operating system than the other virtual machines.",
      "be deployed to a separate resource group.",
      "have two network interfaces."
    ],
    "respuesta": "No change is needed.",
    "categoria": "architecture_services"
  },
  {
    "numero": 429,
    "pregunta": "You plan to extend your company network to Azure. The network contains a VPN appliance that uses an IP address of 131.107.200.1. You need to create an Azure resource that identifies the VPN appliance. Which Azure resource should you create?",
    "opciones": [
      "Virtual networks.",
      "Load balancers.",
      "Virtual networks gateways.",
      "DNS zones.",
      "Traffic Manager profiles.",
      "Network  Watcher.",
      "Virtual networks (classic).",
      "Application gateways.",
      "Local network gateways.",
      "CDN profiles.",
      "ExpressRoute circuits.",
      "Network security groups."
    ],
    "respuesta": "Local network gateways.",
    "categoria": "architecture_services"
  },
  {
    "numero": 430,
    "pregunta": "You have several virtual machines in an Azure subscription. You create a new subscription [the virtual machines cannot be moved to the new subscription].",
    "opciones": [
      "No change is needed.",
      "the virtual machines can be moved to the new subscription.",
      "the virtual machines can be moved to the new subscription only if they are all in the same resource group.",
      "the virtual machines can be moved to the new subscription only if they run Windows Server 2016."
    ],
    "respuesta": "the virtual machines can be moved to the new subscription.",
    "categoria": "architecture_services"
  },
  {
    "numero": 431,
    "pregunta": "[...] is the process of verifying a user credentials.",
    "opciones": [
      "Authorization.",
      "Authentication.",
      "Federation.",
      "Ticketing."
    ],
    "respuesta": "Authentication.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 432,
    "pregunta": "If a resource group named RG1 has a delete lock, [...] can delete RG1.",
    "opciones": [
      "only a member of the global administrators group.",
      "the delete lock must be removed before an administrator.",
      "an Azure policy must be modified before an administrator.",
      "an Azure tag must be added before an administrator."
    ],
    "respuesta": "the delete lock must be removed before an administrator.",
    "categoria": "administration_governance"
  },
  {
    "numero": 433,
    "pregunta": "A Platform as a Service (PaaS) solution that hosts web apps in Azure provides full control of the operating systems that host applications.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 434,
    "pregunta": "A Platform as a Service (PaaS) solution that hosts web apps in Azure can be provided with additional memory by changing the pricing tier.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 435,
    "pregunta": "A Platform as a Service (PaaS) solution that hosts web apps in Azure can be configured to automatically scale the number of instances based on demand.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 436,
    "pregunta": "You have an Azure environment. You need to create a new Azure virtual machine from an Android laptop. Solution: You use PowerShell in Azure Cloud Shell. Does this meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 437,
    "pregunta": "You plan to deploy 20 virtual machines to an Azure environment. To ensure that a virtual machine named VM1 cannot connect to the other virtual machines, VM1 must [...].",
    "opciones": [
      "be deployed to a separate virtual network.",
      "run a different operating system than the other virtual machines.",
      "be deployed to a separate resource group.",
      "have two network interfaces."
    ],
    "respuesta": "be deployed to a separate virtual network.",
    "categoria": "architecture_services"
  },
  {
    "numero": 438,
    "pregunta": "From Azure Service Health, an administrator can view the health of all the services deployed to an Azure environment and all the other services available in Azure.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 439,
    "pregunta": "Match the Azure Services service to the correct descriptions.",
    "opciones": [
      "Analyze security log files from Azure virtual machines: Azure Security Center (now should be Microsoft Defender for Cloud). Display the secure score for an Azure subscription: Azure Lighthouse. Store passwords for use by Azure Function applications: Azure Key Vault.",
      "Analyze security log files from Azure virtual machines: Azure Sentinel. Display the secure score for an Azure subscription: Azure Lighthouse. Store passwords for use by Azure Function applications: Azure Key Vault.",
      "Analyze security log files from Azure virtual machines: Azure Sentinel. Display the secure score for an Azure subscription: Azure Security Center (now should be Microsoft Defender for Cloud). Store passwords for use by Azure Function applications: Azure Key Vault.",
      "Analyze security log files from Azure virtual machines: Azure Sentinel. Display the secure score for an Azure subscription: Azure Security Center (now should be Microsoft Defender for Cloud). Store passwords for use by Azure Function applications: Azure Active Directory (Azure AD) (now should be Microsoft Entra ID)."
    ],
    "respuesta": "Analyze security log files from Azure virtual machines: Azure Sentinel. Display the secure score for an Azure subscription: Azure Security Center (now should be Microsoft Defender for Cloud). Store passwords for use by Azure Function applications: Azure Key Vault.",
    "imagen": "question439.png",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 440,
    "pregunta": "[Azure policies provide] a common platform for deploying objects to a cloud infrastructure and for implementing consistency across the Azure environment.",
    "opciones": [
      "No change is needed.",
      "Resource groups provide.",
      "Azure Resource Manager provides.",
      "Management groups provide."
    ],
    "respuesta": "Azure Resource Manager provides.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 441,
    "pregunta": "All the Azure resources deployed to a single resource group must share the same Azure region.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 442,
    "pregunta": "If you set permissions to a resource group, all the Azure resources in that resource group inherit the permissions.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 443,
    "pregunta": "If you create two Azure virtual machines that use the B2S size, each virtual machine will always generate the same monthly costs.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "architecture_services"
  },
  {
    "numero": 444,
    "pregunta": "When an Azure virtual machine is stopped, you continue to pay storage costs associated to the virtual machine.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "architecture_services"
  },
  {
    "numero": 445,
    "pregunta": "What is the primary purpose of Azure Policy assignments?",
    "opciones": [],
    "respuesta": [],
    "categoria": "administration_governance"
  },
  {
    "numero": 446,
    "pregunta": "Your company has a Software Assurance agreement that includes Microsoft SQL Server licenses. You plan to deploy SQL Server on Azure virtual machines. What should you do to minimize licensing costs for the deployment?",
    "opciones": [
      "Use Azure Reservations.",
      "Use Azure Hybrid Benefit.",
      "Deallocate the virtual machines during off hours.",
      "Configure Azure Cost Management budgets."
    ],
    "respuesta": "Use Azure Hybrid Benefit.",
    "categoria": "architecture_services"
  },
  {
    "numero": 447,
    "pregunta": "If your company uses an Azure free account you can only deploy Azure virtual machines and Azure storage accounts.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "architecture_services"
  },
  {
    "numero": 448,
    "pregunta": "You have an Azure environment. You need to create a new Azure virtual machine from an Android laptop. Solution: You use the Azure portal. Does this meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "architecture_services"
  },
  {
    "numero": 449,
    "pregunta": "You need to create a new Azure virtual machine from an Android laptop. Solution: You use Bash in Azure Cloud Shell. Does this meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 450,
    "pregunta": "Which Azure service should you use to correlate events from multiple resources into a centralized repository?",
    "opciones": [
      "Azure Event Hubs.",
      "Azure Analysis Services.",
      "Azure Monitor.",
      "Azure Log Analytics."
    ],
    "respuesta": "Azure Event Hubs.",
    "categoria": "administration_governance"
  },
  {
    "numero": 451,
    "pregunta": "When planning to migrate a public website to Azure, you must plan to [pay monthly usage costs].",
    "opciones": [
      "No change is needed.",
      "deploy a VPN.",
      "pay to transfer all the website data to Azure.",
      "reduce the number of connections to the website."
    ],
    "respuesta": "No change is needed.",
    "categoria": "administration_governance"
  },
  {
    "numero": 452,
    "pregunta": "When you are implementing a Software as a Service (SaaS) solution, you are responsible for [configuring high availability].",
    "opciones": [
      "No change is needed.",
      "Defining scalability rules.",
      "Installing the SaaS solution.",
      "Configuring the SaaS solution."
    ],
    "respuesta": "Configuring the SaaS solution.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 453,
    "pregunta": "Azure provides flexibility between capital expenditure (CapEx) and operational expenditure (OpEx).",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 454,
    "pregunta": "Your company plans to deploy an Artificial Intelligence (AI) solution in Azure. What should the company use to build, test, and deploy predictive analytics solutions?",
    "opciones": [
      "Azure Logic Apps.",
      "Azure Machine Learning Designer.",
      "Azure Batch.",
      "Azure Cosmos DB."
    ],
    "respuesta": "Azure Machine Learning Designer.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 455,
    "pregunta": "Your company plans to purchase Azure. The company support policy states that the Azure environment must provide an option to access support engineers by phone or email. You need to recommend which support plan meets the support policy requirement. Solution: Recommend a Standard support plan. Does this meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "administration_governance"
  },
  {
    "numero": 456,
    "pregunta": "You have an Azure environment that contains 10 web apps. To which URL should you connect [1] to manage all the Azure resources? https://[1].[2].com.",
    "opciones": [
      "admin.",
      "portal.",
      "www."
    ],
    "respuesta": "portal.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 457,
    "pregunta": "You have an Azure environment that contains 10 web apps. To which URL should you connect [2] to manage all the Azure resources? https://[1].[2].com.",
    "opciones": [
      "azure.",
      "azurewebsites.",
      "microsoft."
    ],
    "respuesta": "azure.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 458,
    "pregunta": "You plan to create an Azure virtual machine. You need to identify which storage service must be used to store the data disks of the virtual machine. What should you identify?",
    "opciones": [
      "Blobs (REST-based object storage for unstructured data).",
      "Files (File shares that use the standard rd SMB 3.0 protocol).",
      "Tables (Tabular data storage).",
      "Queues (Effectively scale apps according to traffic)."
    ],
    "respuesta": "Blobs (REST-based object storage for unstructured data).",
    "categoria": "architecture_services"
  },
  {
    "numero": 459,
    "pregunta": "You have an Azure environment. You need to create a new Azure virtual machine from an Android laptop. Solution: You use the PowerApps portal. Does this meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "architecture_services"
  },
  {
    "numero": 460,
    "pregunta": "To implement an Azure Multi-Factor Authentication (MFA) solution, you must deploy a federation solution or sync on-premises identities to the cloud.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 461,
    "pregunta": "Azure Multi-Factor Authentication (MFA) can be required for administrative and non administrative user accounts.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 462,
    "pregunta": "You need to view a list of planned maintenance events that can affect the availability of an Azure subscription. Which blade should you use from the Azure portal?",
    "opciones": [
      "Dashboard.",
      "All resources.",
      "Resource groups.",
      "App Services.",
      "Function Apps.",
      "SQL databases.",
      "Azure Cosmos DB.",
      "Virtual machines.",
      "Load balancers.",
      "Storage accounts.",
      "Virtual networks.",
      "Microsoft Entra ID.",
      "Monitor.",
      "Advisor.",
      "Security Center.",
      "Help + support."
    ],
    "respuesta": "Help + support.",
    "categoria": "administration_governance"
  },
  {
    "numero": 463,
    "pregunta": "A company can extend the capacity of its internal network by using the public cloud.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 464,
    "pregunta": "You plan to deploy several Azure virtual machines. You need to ensure that the services running on the virtual machines are available if a single data center fails. Solution: You deploy the virtual machines to two or more resource groups. Does this meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "architecture_services"
  },
  {
    "numero": 465,
    "pregunta": "[...] a common platform for deploying objects to a cloud infrastructure and for implementing consistency across the Azure environment.",
    "opciones": [
      "Azure policies provide.",
      "Resource groups provide.",
      "Azure Resource Manager templates provide.",
      "Management groups provide."
    ],
    "respuesta": "Azure Resource Manager templates provide.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 466,
    "pregunta": "Which cloud deployment solution is used for Azure virtual machines and Azure SQL databases?",
    "opciones": [
      "Infrastructure as a service (laaS).",
      "Platform as a service (PaaS).",
      "Software as a service (SaaS)."
    ],
    "respuesta": "Infrastructure as a service (laaS).",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 467,
    "pregunta": "When planning to migrate a public website to Azure, you must plan to [...].",
    "opciones": [
      "deploy a VPN.",
      "pay monthly usage costs.",
      "pay to transfer all the website data to Azure.",
      "reduce the number of connections to the website."
    ],
    "respuesta": "pay monthly usage costs.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 468,
    "pregunta": "Azure Pay-As-You-Go pricing is an example of CapEx.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 469,
    "pregunta": "Azure Reserved VM Instances are an example of OpEx.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 470,
    "pregunta": "Deploying your own datacenter is an example of CapEx.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 471,
    "pregunta": "A company can extend a private cloud by adding its physical servers to the public cloud.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 472,
    "pregunta": "To build a hybrid cloud, you must deploy resources to the public cloud.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 473,
    "pregunta": "A private cloud must be disconnected from the internet.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 474,
    "pregunta": "You plan to deploy several Azure virtual machines. You need to ensure that the services running on the virtual machines are available if a single data center fails. Solution: You deploy the virtual machines to a scale set. Does this meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "architecture_services"
  },
  {
    "numero": 475,
    "pregunta": "You plan to deploy several Azure virtual machines. You need to ensure that the services running on the virtual machines are available if a single data center fails. Solution: You deploy the virtual machines to two or more availability zones. Does this meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 476,
    "pregunta": "When you are implementing a Software as a Service (SaaS) solution, you are responsible for [...].",
    "opciones": [
      "configuring high availability.",
      "defining scalability rules.",
      "installing the Saas solution.",
      "configuring the SaaS solution."
    ],
    "respuesta": "configuring the SaaS solution.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 477,
    "pregunta": "You plan to deploy several Azure virtual machines. You need to ensure that the services running on the virtual machines are available if a single data center fails. Solution: You deploy the virtual machines to two or more regions. Does this meet the goal?",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "architecture_services"
  },
  {
    "numero": 478,
    "pregunta": "Azure resources can only access other resources in the same resource group.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "No.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 479,
    "pregunta": "If you delete a resource group, all the resources in the resource group will be deleted.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 480,
    "pregunta": "A resource group can contain resources from multiple Azure regions.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 481,
    "pregunta": "Data that is copied to an Azure Storage account is maintained automatically in at least three copies.",
    "opciones": [
      "Yes.",
      "No."
    ],
    "respuesta": "Yes.",
    "categoria": "architecture_services"
  },
  {
    "numero": 482,
    "pregunta": "Your company has an on-premises network that contains multiple servers. The company plans to reduce the following administrative responsibilities of network administrators: Backing up application data. Replacing failed server hardware. Managing physical server security. Updating server operating systems. Managing permissions to shared documents. The company plans to migrate several servers to Azure virtual machines. You need to identify which administrative responsibilities will be eliminated after the planned migration. Which two responsibilities should you identify?",
    "opciones": [
      "Replacing failed server hardware.",
      "Backing up application data.",
      "Managing physical server security.",
      "Updating server operating systems.",
      "Managing permissions to shared documents."
    ],
    "respuesta": [
      "Replacing failed server hardware.",
      "Managing physical server security."
    ],
    "categoria": "architecture_services"
  },
  {
    "numero": 483,
    "pregunta": "Azure Cosmos DB is an example of a [Platform as a Service (PaaS)] offering.",
    "opciones": [
      "No change is needed.",
      "Infrastructure as a service (IaaS).",
      "Serverless.",
      "Software as a service (SaaS)."
    ],
    "respuesta": "No change is needed.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 484,
    "pregunta": "[Authorization] is the process of verifying a user credentials.",
    "opciones": [
      "No change is needed.",
      "Authentication.",
      "Federation.",
      "Ticketing."
    ],
    "respuesta": "Authentication.",
    "categoria": "cloud_concepts"
  },
  {
    "numero": 485,
    "pregunta": "You plan to migrate several servers from an on-premises network to Azure. You need to identify the primary benefit of using a public cloud service for the servers. What should you identify?",
    "opciones": [
      "The public cloud is owned by the public, NOT a private corporation.",
      "All public cloud resources can be freely accessed by every member of the public.",
      "The public cloud is a crowd-sourcing solution that provides corporations with the ability to enhance the cloud.",
      "The public cloud is a shared entity whereby multiple corporations each use a portion of the resources in the cloud."
    ],
    "respuesta": "The public cloud is a shared entity whereby multiple corporations each use a portion of the resources in the cloud.",
    "categoria": "cloud_concepts"
  }
]